{
  "categories": [
    {
      "id": "1",
      "category": "Beef",
      "categoryThumb": "https://www.themealdb.com/images/category/beef.png",
      "categoryDescription": "Beef is the culinary name for meat from cattle, particularly skeletal muscle. Humans have been eating beef since prehistoric times.[1] Beef is a source of high-quality protein and essential nutrients.[2]"
    },
    {
      "id": "2",
      "category": "Chicken",
      "categoryThumb": "https://www.themealdb.com/images/category/chicken.png",
      "categoryDescription": "Chicken is a type of domesticated fowl, a subspecies of the red junglefowl. It is one of the most common and widespread domestic animals, with a total population of more than 19 billion as of 2011.[1] Humans commonly keep chickens as a source of food (consuming both their meat and eggs) and, more rarely, as pets."
    },
    {
      "id": "3",
      "category": "Dessert",
      "categoryThumb": "https://www.themealdb.com/images/category/dessert.png",
      "categoryDescription": "Dessert is a course that concludes a meal. The course usually consists of sweet foods, such as confections dishes or fruit, and possibly a beverage such as dessert wine or liqueur, however in the United States it may include coffee, cheeses, nuts, or other savory items regarded as a separate course elsewhere. In some parts of the world, such as much of central and western Africa, and most parts of China, there is no tradition of a dessert course to conclude a meal.\r\n\r\nThe term dessert can apply to many confections, such as biscuits, cakes, cookies, custards, gelatins, ice creams, pastries, pies, puddings, and sweet soups, and tarts. Fruit is also commonly found in dessert courses because of its naturally occurring sweetness. Some cultures sweeten foods that are more commonly savory to create desserts."
    },
    {
      "id": "4",
      "category": "Lamb",
      "categoryThumb": "https://www.themealdb.com/images/category/lamb.png",
      "categoryDescription": "Lamb, hogget, and mutton are the meat of domestic sheep (species Ovis aries) at different ages.\r\n\r\nA sheep in its first year is called a lamb, and its meat is also called lamb. The meat of a juvenile sheep older than one year is hogget; outside the USA this is also a term for the living animal. The meat of an adult sheep is mutton, a term only used for the meat, not the living animals. The term mutton is almost always used to refer to goat meat in the Indian subcontinent.\r\n\r\n"
    },
    {
      "id": "5",
      "category": "Miscellaneous",
      "categoryThumb": "https://www.themealdb.com/images/category/miscellaneous.png",
      "categoryDescription": "General foods that don't fit into another category"
    },
    {
      "id": "6",
      "category": "Pasta",
      "categoryThumb": "https://www.themealdb.com/images/category/pasta.png",
      "categoryDescription": "Pasta is a staple food of traditional Italian cuisine, with the first reference dating to 1154 in Sicily.\r\n\r\nAlso commonly used to refer to the variety of pasta dishes, pasta is typically a noodle made from an unleavened dough of a durum wheat flour mixed with water or eggs and formed into sheets or various shapes, then cooked by boiling or baking. As an alternative for those wanting a different taste, or who need to avoid products containing gluten, some pastas can be made using rice flour in place of wheat.[3][4] Pastas may be divided into two broad categories, dried (pasta secca) and fresh (pasta fresca)."
    },
    {
      "id": "7",
      "category": "Pork",
      "categoryThumb": "https://www.themealdb.com/images/category/pork.png",
      "categoryDescription": "Pork is the culinary name for meat from a domestic pig (Sus scrofa domesticus). It is the most commonly consumed meat worldwide,[1] with evidence of pig husbandry dating back to 5000 BC. Pork is eaten both freshly cooked and preserved. Curing extends the shelf life of the pork products. Ham, smoked pork, gammon, bacon and sausage are examples of preserved pork. Charcuterie is the branch of cooking devoted to prepared meat products, many from pork.\r\n\r\nPork is the most popular meat in Eastern and Southeastern Asia, and is also very common in the Western world, especially in Central Europe. It is highly prized in Asian cuisines for its fat content and pleasant texture. Consumption of pork is forbidden by Jewish and Muslim dietary law, a taboo that is deeply rooted in tradition, with several suggested possible causes. The sale of pork is limited in Israel and illegal in certain Muslim countries."
    },
    {
      "id": "8",
      "category": "Seafood",
      "categoryThumb": "https://www.themealdb.com/images/category/seafood.png",
      "categoryDescription": "Seafood is any form of sea life regarded as food by humans. Seafood prominently includes fish and shellfish. Shellfish include various species of molluscs, crustaceans, and echinoderms. Historically, sea mammals such as whales and dolphins have been consumed as food, though that happens to a lesser extent in modern times. Edible sea plants, such as some seaweeds and microalgae, are widely eaten as seafood around the world, especially in Asia (see the category of sea vegetables). In North America, although not generally in the United Kingdom, the term \"seafood\" is extended to fresh water organisms eaten by humans, so all edible aquatic life may be referred to as seafood. For the sake of completeness, this article includes all edible aquatic life."
    },
    {
      "id": "9",
      "category": "Side",
      "categoryThumb": "https://www.themealdb.com/images/category/side.png",
      "categoryDescription": "A side dish, sometimes referred to as a side order, side item, or simply a side, is a food item that accompanies the entrée or main course at a meal. Side dishes such as salad, potatoes and bread are commonly used with main courses throughout many countries of the western world. New side orders introduced within the past decade[citation needed], such as rice and couscous, have grown to be quite popular throughout Europe, especially at formal occasions (with couscous appearing more commonly at dinner parties with Middle Eastern dishes)."
    },
    {
      "id": "11",
      "category": "Vegan",
      "categoryThumb": "https://www.themealdb.com/images/category/vegan.png",
      "categoryDescription": "Veganism is both the practice of abstaining from the use of animal products, particularly in diet, and an associated philosophy that rejects the commodity status of animals.[b] A follower of either the diet or the philosophy is known as a vegan (pronounced /ˈviːɡən/ VEE-gən). Distinctions are sometimes made between several categories of veganism. Dietary vegans (or strict vegetarians) refrain from consuming animal products, not only meat but also eggs, dairy products and other animal-derived substances.[c] The term ethical vegan is often applied to those who not only follow a vegan diet but extend the philosophy into other areas of their lives, and oppose the use of animals for any purpose.[d] Another term is environmental veganism, which refers to the avoidance of animal products on the premise that the harvesting or industrial farming of animals is environmentally damaging and unsustainable."
    },
    {
      "id": "12",
      "category": "Vegetarian",
      "categoryThumb": "https://www.themealdb.com/images/category/vegetarian.png",
      "categoryDescription": "Vegetarianism is the practice of abstaining from the consumption of meat (red meat, poultry, seafood, and the flesh of any other animal), and may also include abstention from by-products of animal slaughter.\r\n\r\nVegetarianism may be adopted for various reasons. Many people object to eating meat out of respect for sentient life. Such ethical motivations have been codified under various religious beliefs, as well as animal rights advocacy. Other motivations for vegetarianism are health-related, political, environmental, cultural, aesthetic, economic, or personal preference. There are variations of the diet as well: an ovo-lacto vegetarian diet includes both eggs and dairy products, an ovo-vegetarian diet includes eggs but not dairy products, and a lacto-vegetarian diet includes dairy products but not eggs. A vegan diet excludes all animal products, including eggs and dairy. Some vegans also avoid other animal products such as beeswax, leather or silk clothing, and goose-fat shoe polish."
    },
    {
      "id": "13",
      "category": "Breakfast",
      "categoryThumb": "https://www.themealdb.com/images/category/breakfast.png",
      "categoryDescription": "Breakfast is the first meal of a day. The word in English refers to breaking the fasting period of the previous night. There is a strong likelihood for one or more \"typical\", or \"traditional\", breakfast menus to exist in most places, but their composition varies widely from place to place, and has varied over time, so that globally a very wide range of preparations and ingredients are now associated with breakfast."
    }
  ],
  "meals": [
    {
      "id": "52883",
      "meal": "Sticky Toffee Pudding",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "British",
      "instructions": "Preheat the oven to 180C/160C Fan/Gas 4. Butter a wide shallow 1.7-litre/3-pint ovenproof dish.\r\nPut the butter, sugar, eggs, flour, baking powder, bicarbonate of soda and treacle into a mixing bowl. Beat using an electric handheld whisk for about 30 seconds or until combined. Pour in the milk gradually and whisk again until smooth. Pour into the prepared dish. Bake for 35–40 minutes or until well risen and springy in the centre.\r\nTo make the sauce, put all the ingredients into a saucepan and stir over a low heat until the sugar has dissolved and the butter has melted. Bring to the boil, stirring for a minute.\r\nTo serve, pour half the sauce over the pudding in the baking dish. Serve with the cream or ice cream.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/xqqqtu1511637379.jpg",
      "tags": "Pudding,Cake,Desert",
      "youtube": "https://www.youtube.com/watch?v=Wytv3bjqJII",
      "source": "https://www.bbc.co.uk/food/recipes/marys_sticky_toffee_41970",
      "ingredients": [
        {
          "ingredient": "Butter",
          "measure": "100g "
        },
        {
          "ingredient": "Muscovado Sugar",
          "measure": "175g"
        },
        {
          "ingredient": "Eggs",
          "measure": "2 large"
        },
        {
          "ingredient": "Self-raising Flour",
          "measure": "225g"
        },
        {
          "ingredient": "Baking Powder",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Bicarbonate Of Soda",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Black Treacle",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Milk",
          "measure": "275ml"
        },
        {
          "ingredient": "Double Cream",
          "measure": "to serve"
        },
        {
          "ingredient": "Butter",
          "measure": "100g "
        },
        {
          "ingredient": "Muscovado Sugar",
          "measure": "125g"
        },
        {
          "ingredient": "Black Treacle",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Double Cream",
          "measure": "300ml "
        },
        {
          "ingredient": "Vanilla Extract",
          "measure": "1 tsp "
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52856",
      "meal": "Choc Chip Pecan Pie",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "American",
      "instructions": "First, make the pastry. Tip the ingredients into a food processor with 1 /4 tsp salt. Blend until the mixture resembles breadcrumbs. Drizzle 2-3 tsp cold water into the funnel while the blade is running – the mixture should start to clump together. Tip onto a work surface and bring together, kneading briefly into a ball. Pat into a disc, wrap in cling film, and chill for at least 20 mins. Heat oven to 200C/180C fan/gas 6.\r\n\r\nRemove the pastry from the fridge and leave at room temperature for 5 mins to soften. Flour the work surface, then unwrap the pastry and roll to a circle the thickness of a £1 coin. Use the pastry to line a deep, 23cm round fluted tin – mine was about 3cm deep. Press the pastry into the corners and up the sides, making sure there are no gaps. Leave 1cm pastry overhanging (save some of the pastry scraps for later). Line with baking parchment (scrunch it up first to make it more pliable) and fill with baking beans. Blind-bake for 15-20 mins until the sides are set, then remove the parchment and beans and return to the oven for 5 mins until golden brown. Trim the pastry so it’s flush with the top of the tin – a small serrated knife is best for this. If there are any cracks, patch them up with the pastry scraps.\r\n\r\nMeanwhile, weigh the butter, syrup and sugars into a pan, and add 1 /4 tsp salt. Heat until the butter has melted and the sugar dissolved, stirring until smooth. Remove from the heat and cool for 10 mins. Reduce oven to 160C/140C fan/gas 3.\r\n\r\nBeat the eggs in a bowl. Add the syrup mixture, vanilla and pecans, and mix until well combined. Pour half the mixture into the tart case, scatter over half the chocolate chips, then cover with the remaining filling and chocolate chips. Bake on the middle shelf for 50-55 mins until set. Remove from the oven and leave to cool, then chill for at least 2 hrs before serving.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/rqvwxt1511384809.jpg",
      "tags": "Pie,Desert,Sweet,Nutty",
      "youtube": "https://www.youtube.com/watch?v=fDpoT0jvg4Y",
      "source": "https://www.bbcgoodfood.com/recipes/choc-chip-pecan-pie",
      "ingredients": [
        {
          "ingredient": "Plain Flour",
          "measure": "300g"
        },
        {
          "ingredient": "Butter",
          "measure": "75g"
        },
        {
          "ingredient": "Cream Cheese",
          "measure": "100g "
        },
        {
          "ingredient": "Icing Sugar",
          "measure": "1 tbls"
        },
        {
          "ingredient": "Butter",
          "measure": "150g"
        },
        {
          "ingredient": "Maple Syrup",
          "measure": "200ml"
        },
        {
          "ingredient": "Light Brown Soft Sugar",
          "measure": "250g"
        },
        {
          "ingredient": "Dark Brown Soft Sugar",
          "measure": "100g "
        },
        {
          "ingredient": "Eggs",
          "measure": "4"
        },
        {
          "ingredient": "Vanilla Extract",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Pecan Nuts",
          "measure": "400g"
        },
        {
          "ingredient": "Dark Chocolate Chips",
          "measure": "200g"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52938",
      "meal": "Jamaican Beef Patties",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "Jamaican",
      "instructions": "Make the Pastry Dough\r\n\r\nTo a large bowl, add flour, 1 teaspoon salt, and turmeric and mix thoroughly.\r\nRub shortening into flour until there are small pieces of shortening completely covered with flour.\r\nPour in 1/2 cup of the ice water and mix with your hands to bring the dough together. Keep adding ice water 2 to 3 tablespoons at a time until the mixture forms a dough.\r\nAt this stage, you can cut the dough into 2 large pieces, wrap in plastic and refrigerate for 30 minutes before using it.\r\nAlternatively, cut the dough into 10 to 12 equal pieces, place on a platter or baking sheet, cover securely with plastic wrap and let chill for 30 minutes while you make the filling.\r\nMake the Filling\r\n\r\nAdd ground beef to a large bowl. Sprinkle in allspice and black pepper. Mix together and set aside.\r\nHeat oil in a skillet until hot.\r\nAdd onions and sauté until translucent. Add hot pepper, garlic and thyme and continue to sauté for another minute. Add 1/4 teaspoon salt.\r\nAdd seasoned ground beef and toss to mix, breaking up any clumps, and let cook until the meat is no longer pink.\r\nAdd ketchup and more salt to taste.\r\nPour in 2 cups of water and stir. Bring the mixture to a boil then reduce heat and let simmer until most of the liquid has evaporated and whatever is remaining has reduced to a thick sauce.\r\nFold in green onions. Remove from heat and let cool completely.\r\nAssemble the Patties\r\n\r\nBeat the egg and water together to make an egg wash. Set aside.\r\nNow you can prepare the dough in two ways.\r\nFirst Method: Flour the work surface and rolling pin. If you had cut it into 2 large pieces, then take one of the large pieces and roll it out into a very large circle. Take a bowl with a wide rim (about 5 inches) and cut out three circles.\r\n\r\nPlace about 3 heaping tablespoons of the filling onto 1/2 of each circle. Dip a finger into the water and moisten the edges of the pastry. Fold over the other half and press to seal. \r\n\r\nTake a fork and crimp the edges. Cut off any extra to make it look neat and uniform. Place on a parchment-lined baking sheet and continue to work until you have rolled all the dough and filled the patties.\r\nSecond Method: If you had pre-cut the dough into individual pieces, work with one piece of dough at a time. Roll it out on a floured surface into a 5-inch circle or a little larger. Don’t worry if the edges are not perfect.\r\n\r\nPlace 3 heaping tablespoons of the filling on one side of the circle. Dip a finger into the water and moisten the edges of the pastry. Fold over the other half and press to seal.\r\n\r\nTake a fork and crimp the edges. Cut off any extra to make it look neat and uniform. Place on a parchment-lined baking sheet and continue work until you have rolled all the dough and filled the patties.\r\n\r\nFrying and Serving the Patties\r\n\r\nAfter forming the patties, place the pans in the refrigerator while you heat the oven to 350 F.\r\nJust before adding the pans with the patties to the oven, brush the patties with egg wash.\r\nBake patties for 30 minutes or until golden brown.\r\nCool on wire racks.\r\nServe warm.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wsqqsw1515364068.jpg",
      "tags": "Snack,Spicy",
      "youtube": "https://www.youtube.com/watch?v=ypQjoiZiTac",
      "source": "https://www.thespruce.com/jamaican-beef-patties-recipe-2137762",
      "ingredients": [
        {
          "ingredient": "Plain Flour",
          "measure": "4 cups "
        },
        {
          "ingredient": "Salt",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Curry Powder",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Butter",
          "measure": "250g"
        },
        {
          "ingredient": "Water",
          "measure": "1 cup "
        },
        {
          "ingredient": "Minced Beef",
          "measure": "900g"
        },
        {
          "ingredient": "Allspice",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Black Pepper",
          "measure": "1/2 tsp"
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Onions",
          "measure": "1 cup "
        },
        {
          "ingredient": "Red Pepper",
          "measure": "Ground"
        },
        {
          "ingredient": "Garlic",
          "measure": "2 tsp ground"
        },
        {
          "ingredient": "Thyme",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Salt",
          "measure": "1/4 tsp"
        },
        {
          "ingredient": "Tomato Ketchup",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Water",
          "measure": "2 cups "
        },
        {
          "ingredient": "Onions",
          "measure": "1/2 cup "
        },
        {
          "ingredient": "Egg",
          "measure": "1 beaten"
        },
        {
          "ingredient": "Water",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Water",
          "measure": "1/4 cup"
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "53067",
      "meal": "Stuffed Bell Peppers with Quinoa and Black Beans",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "Mexican",
      "instructions": "1. Preheat your oven to 375°F (190°C). Lightly grease a 9x13-inch baking dish or a similar-sized casserole dish.\r\n2. Place the bell pepper halves in the prepared baking dish, cut side up. Bake for 15-20 minutes, or until slightly softened.\r\n3. While the bell peppers are baking, prepare the filling. In a large skillet, heat the olive oil over medium heat. Add the chopped onion, and cook for 3-4 minutes, until softened. Add the garlic, and cook for another 1 minute, until fragrant.\r\n4. Stir in the cooked quinoa, black beans, corn, diced tomatoes, ground cumin, chili powder, smoked paprika, salt, and pepper. Cook for 5-7 minutes, until heated through. Remove the skillet from heat, and stir in 1 cup of the shredded cheese, if using.\r\n5. Remove the bell peppers from the oven, and carefully stuff each pepper half with the quinoa and black bean mixture. Top the stuffed peppers with the remaining 1/2 cup of shredded cheese, if using.\r\n6. Return the stuffed peppers to the oven, and bake for another 15-20 minutes, until the cheese is melted and the peppers are tender.\r\n7. Remove from the oven, and allow the stuffed peppers to cool for 5 minutes before serving. Garnish with fresh chopped cilantro.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/b66myb1683207208.jpg",
      "tags": null,
      "youtube": "",
      "source": "",
      "ingredients": [
        {
          "ingredient": "Green Pepper",
          "measure": "4 whole"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "1 tablespoon"
        },
        {
          "ingredient": "Onion",
          "measure": "1 small finely diced"
        },
        {
          "ingredient": "Garlic",
          "measure": "2 cloves minced"
        },
        {
          "ingredient": "Quinoa",
          "measure": "1 cups"
        },
        {
          "ingredient": "Black Beans",
          "measure": "1 can "
        },
        {
          "ingredient": "Sweetcorn",
          "measure": "1 cup "
        },
        {
          "ingredient": "Diced Tomatoes",
          "measure": "1 can "
        },
        {
          "ingredient": "Cumin",
          "measure": "1 teaspoon"
        },
        {
          "ingredient": "Chili Powder",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Smoked Paprika",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Salt",
          "measure": "To taste"
        },
        {
          "ingredient": "Pepper",
          "measure": "To taste"
        },
        {
          "ingredient": "Shredded Mexican Cheese",
          "measure": "1 1/2 cup "
        },
        {
          "ingredient": "Cilantro",
          "measure": "Chopped"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "53026",
      "meal": "Tamiya",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "Egyptian",
      "instructions": "oak the beans in water to cover overnight.Drain. If skinless beans are unavailable, rub to loosen the skins, then discard the skins. Pat the beans dry with a towel.\r\nGrind the beans in a food mill or meat grinder.If neither appliance is available, process them in a food processor but only until the beans form a paste. (If blended too smoothly, the batter tends to fall apart during cooking.) Add the scallions, garlic, cilantro, cumin, baking powder, cayenne, salt, pepper, and coriander, if using.  Refrigerate for at least 30 minutes.\r\nShape the bean mixture into 1-inch balls.Flatten slightly and coat with flour.\r\nHeat at least 1½-inches of oil over medium heat to 365 degrees.\r\nFry the patties in batches, turning once, until golden brown on all sides, about 5 minutes.Remove with a wire mesh skimmer or slotted spoon. Serve as part of a meze or in pita bread with tomato-cucumber salad and tahina sauce.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/n3xxd91598732796.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=mulqW-J3Yy4",
      "source": "https://oukosher.org/recipes/tamiya-egyptian-dried-fava-bean-fritters/",
      "ingredients": [
        {
          "ingredient": "Broad Beans",
          "measure": "3 cups "
        },
        {
          "ingredient": "Spring Onions",
          "measure": "6"
        },
        {
          "ingredient": "Garlic Clove",
          "measure": "4"
        },
        {
          "ingredient": "Parsley",
          "measure": "1/4 cup"
        },
        {
          "ingredient": "Cumin",
          "measure": "2 tsp"
        },
        {
          "ingredient": "Baking Powder",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Cayenne Pepper",
          "measure": "1/2 tsp"
        },
        {
          "ingredient": "Flour",
          "measure": "Spinkling"
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": "As required"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "52806",
      "meal": "Tandoori chicken",
      "drinkAlternate": null,
      "category": "Chicken",
      "area": "Indian",
      "instructions": "Mix the lemon juice with the paprika and red onions in a large shallow dish. Slash each chicken thigh three times, then turn them in the juice and set aside for 10 mins.\r\nMix all of the marinade ingredients together and pour over the chicken. Give everything a good mix, then cover and chill for at least 1 hr. This can be done up to a day in advance.\r\nHeat the grill. Lift the chicken pieces onto a rack over a baking tray. Brush over a little oil and grill for 8 mins on each side or until lightly charred and completely cooked through.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/qptpvt1487339892.jpg",
      "tags": "Spicy,Meat",
      "youtube": "https://www.youtube.com/watch?v=-CKvt1KNU74",
      "source": "http://www.bbcgoodfood.com/recipes/1660651/tandoori-chicken",
      "ingredients": [
        {
          "ingredient": "lemons",
          "measure": "2 Juice"
        },
        {
          "ingredient": "paprika",
          "measure": "4 tsp"
        },
        {
          "ingredient": "red onions",
          "measure": "2 finely chopped"
        },
        {
          "ingredient": "chicken thighs",
          "measure": "16 skinnless"
        },
        {
          "ingredient": "vegetable oil",
          "measure": "For brushing"
        },
        {
          "ingredient": "Greek yogurt",
          "measure": "300ml "
        },
        {
          "ingredient": "ginger",
          "measure": "large piece"
        },
        {
          "ingredient": "garlic clove",
          "measure": "4"
        },
        {
          "ingredient": "garam masala",
          "measure": "¾ tsp"
        },
        {
          "ingredient": "ground cumin",
          "measure": "¾ tsp"
        },
        {
          "ingredient": "chilli powder",
          "measure": "½ tsp"
        },
        {
          "ingredient": "turmeric",
          "measure": "¼ tsp"
        }
      ],
      "categoryId": "2"
    },
    {
      "id": "52995",
      "meal": "BBQ Pork Sloppy Joes",
      "drinkAlternate": null,
      "category": "Pork",
      "area": "American",
      "instructions": "1\r\n\r\nPreheat oven to 450 degrees. Wash and dry all produce. Cut sweet potatoes into ½-inch-thick wedges. Toss on a baking sheet with a drizzle of oil, salt, and pepper. Roast until browned and tender, 20-25 minutes.\r\n\r\n2\r\n\r\nMeanwhile, halve and peel onion. Slice as thinly as possible until you have ¼ cup (½ cup for 4 servings); finely chop remaining onion. Peel and finely chop garlic. Halve lime; squeeze juice into a small bowl. Halve buns. Add 1 TBSP butter (2 TBSP for 4) to a separate small microwave-safe bowl; microwave until melted, 30 seconds. Brush onto cut sides of buns.\r\n\r\n3\r\n\r\nTo bowl with lime juice, add sliced onion, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. Stir to combine; set aside to quick-pickle.\r\n\r\n4\r\n\r\nHeat a drizzle of oil in a large pan over medium-high heat. Add chopped onion and season with salt and pepper. Cook, stirring, until softened, 4-5 minutes. Add garlic and cook until fragrant, 30 seconds more. Add pork and season with salt and pepper. Cook, breaking up meat into pieces, until browned and cooked through, 4-6 minutes.\r\n\r\n5\r\n\r\nWhile pork cooks, in a third small bowl, combine BBQ sauce, pickling liquid from onion, 3 TBSP ketchup (6 TBSP for 4 servings), ½ tsp sugar (1 tsp for 4), and ¼ cup water (⅓ cup for 4). Once pork is cooked through, add BBQ sauce mixture to pan. Cook, stirring, until sauce is thickened, 2-3 minutes. Taste and season with salt and pepper.\r\n\r\n6\r\n\r\nMeanwhile, toast buns in oven or toaster oven until golden, 3-5 minutes. Divide toasted buns between plates and fill with as much BBQ pork as you’d like. Top with pickled onion and hot sauce. Serve with sweet potato wedges on the side.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/atd5sh1583188467.jpg",
      "tags": null,
      "youtube": "",
      "source": "",
      "ingredients": [
        {
          "ingredient": "Potatoes",
          "measure": "2"
        },
        {
          "ingredient": "Red Onions",
          "measure": "1"
        },
        {
          "ingredient": "Garlic",
          "measure": "2 cloves"
        },
        {
          "ingredient": "Lime",
          "measure": "1"
        },
        {
          "ingredient": "Bread",
          "measure": "2"
        },
        {
          "ingredient": "Pork",
          "measure": "1 lb"
        },
        {
          "ingredient": "Barbeque Sauce",
          "measure": " "
        },
        {
          "ingredient": "Hotsauce",
          "measure": " "
        },
        {
          "ingredient": "Tomato Ketchup",
          "measure": " "
        },
        {
          "ingredient": "Sugar",
          "measure": " "
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": " "
        },
        {
          "ingredient": "Salt",
          "measure": " "
        },
        {
          "ingredient": "Pepper",
          "measure": " "
        }
      ],
      "categoryId": "7"
    },
    {
      "id": "53015",
      "meal": "Krispy Kreme Donut",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "American",
      "instructions": "Dissolve yeast in warm water in 2 1/2-quart bowl. Add milk, sugar, salt, eggs, shortening and 2 cups flour. Beat on low for 30 seconds, scraping bowl constantly. Beat on medium speed for 2 minutes, scraping bowl occasionally. Stir in remaining flour until smooth. Cover and let rise until double, 50-60 minutes. (Dough is ready when indentation remains when touched.) Turn dough onto floured surface; roll around lightly to coat with flour. Gently roll dough 1/2-inch thick with floured rolling pin. Cut with floured doughnut cutter. Cover and let rise until double, 30-40 minutes.\r\nHeat vegetable oil in deep fryer to 350°. Slide doughnuts into hot oil with wide spatula. Turn doughnuts as they rise to the surface. Fry until golden brown, about 1 minute on each side. Remove carefully from oil (do not prick surface); drain. Dip the doughnuts into creamy glaze set on rack.\r\n\r\n\r\nGlaze: \r\nHeat butter until melted. Remove from heat. Stir in powdered sugar and vanilla until smooth. Stir in water, 1 tablespoon at a time, until desired consistency.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/4i5cnx1587672171.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=SamYg6IUGOI",
      "source": "https://www.mythirtyspot.com/krispy-kreme-copycat-recipe-for/",
      "ingredients": [
        {
          "ingredient": "Yeast",
          "measure": "1/4 ounce"
        },
        {
          "ingredient": "Water",
          "measure": "1/4 cup"
        },
        {
          "ingredient": "Water",
          "measure": "1 1/2 cups "
        },
        {
          "ingredient": "Sugar",
          "measure": "1/2 cup "
        },
        {
          "ingredient": "Salt",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Eggs",
          "measure": "2"
        },
        {
          "ingredient": "Shortening",
          "measure": "1/3 cup"
        },
        {
          "ingredient": "Flour",
          "measure": "5 drops"
        },
        {
          "ingredient": "Canola Oil",
          "measure": "Sprinking"
        },
        {
          "ingredient": "Milk",
          "measure": "1/2 cup"
        },
        {
          "ingredient": "Sugar",
          "measure": "2 cups "
        },
        {
          "ingredient": "Vanilla",
          "measure": "1 1/2 cups "
        },
        {
          "ingredient": "Boiling Water",
          "measure": "6 tablespoons"
        },
        {
          "ingredient": "Butter",
          "measure": " 1/3 cup"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52907",
      "meal": "Duck Confit",
      "drinkAlternate": null,
      "category": "Miscellaneous",
      "area": "French",
      "instructions": "The day before you want to make the dish, scatter half the salt, half the garlic and half of the herbs over the base of a small shallow dish. Lay the duck legs, skin-side up, on top, then scatter over the remaining salt, garlic and herbs. Cover the duck and refrigerate overnight. This can be done up to 2 days ahead.\r\nPour the wine into a saucepan that will snugly fit the duck legs in a single layer. Brush the salt off the duck legs and place them, skin-side down, in the wine. Cover the pan with a lid and place over a medium heat. As soon as the wine starts to bubble, turn the heat down to the lowest setting and cook for 2 hours, checking occasionally that the liquid is just barely simmering. (If you own a heat diffuser, it would be good to use it here.) After 2 hours, the duck legs should be submerged in their own fat and the meat should feel incredibly tender when prodded. Leave to cool.\r\nThe duck legs are now cooked and can be eaten immediately – or you can follow the next step if you like them crisp. If you are preparing ahead, pack the duck legs tightly into a plastic container or jar and pour over the fat, but not the liquid at the bottom of the pan. Cover and leave in the fridge for up to a month, or freeze for up to 3 months. The liquid you are left with makes a tasty gravy, which can be chilled or frozen until needed.\r\nTo reheat and crisp up the duck legs, heat oven to 220C/fan 200C/gas 7. Remove the legs from the fat and place them, skin-side down, in an ovenproof frying pan. Roast for 30-40 mins, turning halfway through, until brown and crisp. Serve with the reheated gravy, a crisp salad and some crisp golden ptoatoes.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wvpvsu1511786158.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=MHhLJqghY-o",
      "source": "https://www.bbcgoodfood.com/recipes/2085/barneys-confit-of-duck",
      "ingredients": [
        {
          "ingredient": "Sea Salt",
          "measure": "Handful"
        },
        {
          "ingredient": "Bay Leaf",
          "measure": "4"
        },
        {
          "ingredient": "Garlic",
          "measure": "4 cloves"
        },
        {
          "ingredient": "Thyme",
          "measure": "Handful"
        },
        {
          "ingredient": "Duck Legs",
          "measure": "4"
        },
        {
          "ingredient": "White Wine",
          "measure": "100ml"
        }
      ],
      "categoryId": "5"
    },
    {
      "id": "52866",
      "meal": "Squash linguine",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "Italian",
      "instructions": "Heat oven to 200C/180C fan/gas 6. Put the squash and garlic on a baking tray and drizzle with the olive oil. Roast for 35-40 mins until soft. Season.\r\nCook the pasta according to pack instructions. Drain, reserving the water. Use a stick blender to whizz the squash with 400ml cooking water. Heat some oil in a frying pan, fry the sage until crisp, then drain on kitchen paper. Tip the pasta and sauce into the pan and warm through. Scatter with sage.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wxswxy1511452625.jpg",
      "tags": "Pasta,Light",
      "youtube": "https://www.youtube.com/watch?v=xHZ-PoGwTLQ",
      "source": "https://www.bbcgoodfood.com/recipes/creamy-squash-linguine",
      "ingredients": [
        {
          "ingredient": "Butternut Squash",
          "measure": "350g"
        },
        {
          "ingredient": "Garlic",
          "measure": "3 parts "
        },
        {
          "ingredient": "Olive Oil",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Linguine Pasta",
          "measure": "350g"
        },
        {
          "ingredient": "Sage",
          "measure": "Small bunch"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "52819",
      "meal": "Cajun spiced fish tacos",
      "drinkAlternate": null,
      "category": "Seafood",
      "area": "Mexican",
      "instructions": "Cooking in a cajun spice and cayenne pepper marinade makes this fish super succulent and flavoursome. Top with a zesty dressing and serve in a tortilla for a quick, fuss-free main that's delightfully summery.\r\n\r\nOn a large plate, mix the cajun spice and cayenne pepper with a little seasoning and use to coat the fish all over.\r\n\r\nHeat a little oil in a frying pan, add in the fish and cook over a medium heat until golden. Reduce the heat and continue frying until the fish is cooked through, about 10 minutes. Cook in batches if you don’t have enough room in the pan.\r\n\r\nMeanwhile, prepare the dressing by combining all the ingredients with a little seasoning.\r\nSoften the tortillas by heating in the microwave for 5-10 seconds. Pile high with the avocado, lettuce and spring onion, add a spoonful of salsa, top with large flakes of fish and drizzle over the dressing.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/uvuyxu1503067369.jpg",
      "tags": "Spicy,Fish",
      "youtube": "https://www.youtube.com/watch?v=N4EdUt0Ou48",
      "source": "https://realfood.tesco.com/recipes/cajun-spiced-fish-tacos.html",
      "ingredients": [
        {
          "ingredient": "cajun",
          "measure": "2 tbsp"
        },
        {
          "ingredient": "cayenne pepper",
          "measure": "1 tsp"
        },
        {
          "ingredient": "white fish",
          "measure": "4 fillets"
        },
        {
          "ingredient": "vegetable oil",
          "measure": "1 tsp"
        },
        {
          "ingredient": "flour tortilla",
          "measure": "8"
        },
        {
          "ingredient": "avocado",
          "measure": "1 sliced"
        },
        {
          "ingredient": "little gem lettuce",
          "measure": "2 shredded"
        },
        {
          "ingredient": "Spring Onions",
          "measure": "4 shredded"
        },
        {
          "ingredient": "salsa",
          "measure": "1 x 300ml"
        },
        {
          "ingredient": "sour cream",
          "measure": "1 pot"
        },
        {
          "ingredient": "lemon",
          "measure": "1"
        },
        {
          "ingredient": "garlic",
          "measure": "1 clove finely chopped"
        }
      ],
      "categoryId": "8"
    },
    {
      "id": "53035",
      "meal": "Ham hock colcannon",
      "drinkAlternate": null,
      "category": "Pork",
      "area": "Irish",
      "instructions": "STEP 1\r\nPeel and cut the potatoes into even, medium-sized chunks. Put in a large pan filled with cold salted water, bring to the boil and cook for 10-15 mins until a knife can be inserted into the potatoes easily.\r\n\r\nSTEP 2\r\nMeanwhile, melt the butter in a large sauté pan over a medium heat. Add the garlic, cabbage, spring onions and some seasoning. Stir occasionally until the cabbage is wilted but still retains a little bite, then set aside.\r\n\r\nSTEP 3\r\nDrain the potatoes, leave to steam-dry for a couple of mins, then mash with the cream, mustard and seasoning in the same saucepan. Stir in the cabbage and ham hock. Keep warm over a low heat.\r\n\r\nSTEP 4\r\nReheat the pan you used to cook the cabbage (no need to wash first), add a splash of oil, crack in the eggs and fry to your liking. To serve, divide the colcannon between bowls and top each with a fried egg.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/n41ny81608588066.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=aQJAU2iJ730",
      "source": "https://www.bbcgoodfood.com/recipes/ham-hock-colcannon",
      "ingredients": [
        {
          "ingredient": "Floury Potatoes",
          "measure": "800g"
        },
        {
          "ingredient": "Butter",
          "measure": "50g"
        },
        {
          "ingredient": "Garlic Clove",
          "measure": "3 chopped"
        },
        {
          "ingredient": "Cabbage",
          "measure": "1 chopped"
        },
        {
          "ingredient": "Spring Onions",
          "measure": "8"
        },
        {
          "ingredient": "Double Cream",
          "measure": "100ml"
        },
        {
          "ingredient": "Mustard",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Ham",
          "measure": "180g"
        },
        {
          "ingredient": "Eggs",
          "measure": "4"
        }
      ],
      "categoryId": "7"
    },
    {
      "id": "52852",
      "meal": "Tuna Nicoise",
      "drinkAlternate": null,
      "category": "Seafood",
      "area": "French",
      "instructions": "Heat oven to 200C/fan 180C/gas 6. Toss the potatoes with 2 tsp oil and some seasoning. Tip onto a large baking tray, then roast for 20 mins, stirring halfway, until crisp, golden and cooked through.\r\nMeanwhile, put eggs in a small pan of water, bring to the boil, then simmer for 8-10 mins, depending on how you like them cooked. Plunge into a bowl of cold water to cool for a few mins. Peel away the shells, then cut into halves.\r\nIn a large salad bowl, whisk together the remaining oil, red wine vinegar, capers and chopped tomatoes. Season, tip in the onion, spinach, tuna and potatoes, then gently toss together. Top with the eggs, then serve straight away.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/yypwwq1511304979.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=3_UAxkx0u6U",
      "source": "https://www.bbcgoodfood.com/recipes/9529/winter-tuna-nioise",
      "ingredients": [
        {
          "ingredient": "Potatoes",
          "measure": "450g"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "2 tblsp "
        },
        {
          "ingredient": "Eggs",
          "measure": "4"
        },
        {
          "ingredient": "Red Wine Vinegar",
          "measure": "1 tbls"
        },
        {
          "ingredient": "Capers",
          "measure": "2 tblsp "
        },
        {
          "ingredient": "Sunflower Oil",
          "measure": "50g"
        },
        {
          "ingredient": "Red Onions",
          "measure": "½"
        },
        {
          "ingredient": "Spinach",
          "measure": "100g "
        },
        {
          "ingredient": "Tuna",
          "measure": "400g"
        }
      ],
      "categoryId": "8"
    },
    {
      "id": "52955",
      "meal": "Egg Drop Soup",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "Chinese",
      "instructions": "In a wok add chicken broth and wait for it to boil.\r\nNext add salt, sugar, white pepper, sesame seed oil.\r\nWhen the chicken broth is boiling add the vegetables to the wok.\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness.\r\nNext add 1 egg slightly beaten with a knife or fork and add it to the soup slowly and stir for 8 seconds\r\nServe the soup in a bowl and add the green onions on top.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/1529446137.jpg",
      "tags": "Soup,Baking,Calorific",
      "youtube": "https://www.youtube.com/watch?v=9XpzHm9QpZg",
      "source": "https://sueandgambo.com/pages/egg-drop-soup",
      "ingredients": [
        {
          "ingredient": "Chicken Stock",
          "measure": "3 cups "
        },
        {
          "ingredient": "Salt",
          "measure": "1/4 tsp"
        },
        {
          "ingredient": "Sugar",
          "measure": "1/4 tsp"
        },
        {
          "ingredient": "Pepper",
          "measure": "pinch"
        },
        {
          "ingredient": "Sesame Seed Oil",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Peas",
          "measure": "1/3 cup"
        },
        {
          "ingredient": "Mushrooms",
          "measure": "1/3 cup"
        },
        {
          "ingredient": "Cornstarch",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Water",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Spring Onions",
          "measure": "1/4 cup"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "52927",
      "meal": "Montreal Smoked Meat",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "Canadian",
      "instructions": "To make the cure, in a small bowl mix together salt, pink salt, black pepper, coriander, sugar, bay leaf, and cloves. Coat entire brisket with the cure and place in an extra-large resealable plastic bag. Place in the coldest part of the refrigerator and cure for 4 days, flipping brisket twice a day.\r\nRemove brisket from bag and wash as much cure off as possible under cold running water. Place brisket in a large container and fill with water and let soak for 2 hours, replacing water every 30 minutes. Remove from water and pat dry with paper towels.\r\nTo make the rub, mix together black pepper, coriander, paprika, garlic powder, onion powder, dill weed, mustard, celery seed, and crushed red papper in a small bowl. Coat entire brisket with the rub.\r\nFire up smoker or grill to 225 degrees, adding chunks of smoking wood chunks when at temperature. When wood is ignited and producing smoke, place brisket in, fat side up, and smoke until an instant read thermometer registers 165 degrees when inserted into thickest part of the brisket, about 6 hours.\r\nTransfer brisket to large roasting pan with V-rack. Place roasting pan over two burners on stovetop and fill with 1-inch of water. Bring water to a boil over high heat, reduce heat to medium, cover roasting pan with aluminum foil, and steam brisket until an instant read thermometer registers 180 degrees when inserted into thickest part of the meat, 1 to 2 hours, adding more hot water as needed.\r\nTransfer brisket to cutting board and let cool slightly. Slice and serve, preferably on rye with mustard.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/uttupv1511815050.jpg",
      "tags": "Speciality,Snack,StrongFlavor",
      "youtube": "https://www.youtube.com/watch?v=g5oCDoyxbBk",
      "source": "http://www.meatwave.com/blog/montreal-smoked-meat-recipe",
      "ingredients": [
        {
          "ingredient": "Beef Brisket",
          "measure": "1"
        },
        {
          "ingredient": "Salt",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Black Pepper",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Coriander",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Sugar",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Bay Leaf",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Cloves",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Black Pepper",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Coriander",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Paprika",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Garlic",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Onion",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Dill",
          "measure": "1 tbs"
        },
        {
          "ingredient": "English Mustard",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Celery Salt",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Red Pepper Flakes",
          "measure": "1 tsp "
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "52857",
      "meal": "Pumpkin Pie",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "American",
      "instructions": "Place the pumpkin in a large saucepan, cover with water and bring to the boil. Cover with a lid and simmer for 15 mins or until tender. Drain pumpkin; let cool.\r\nHeat oven to 180C/160C fan/gas 4. Roll out the pastry on a lightly floured surface and use it to line a 22cm loose-bottomed tart tin. Chill for 15 mins. Line the pastry with baking parchment and baking beans, then bake for 15 mins. Remove the beans and paper, and cook for a further 10 mins until the base is pale golden and biscuity. Remove from the oven and allow to cool slightly.\r\nIncrease oven to 220C/200C fan/gas 7. Push the cooled pumpkin through a sieve into a large bowl. In a separate bowl, combine the sugar, salt, nutmeg and half the cinnamon. Mix in the beaten eggs, melted butter and milk, then add to the pumpkin purée and stir to combine. Pour into the tart shell and cook for 10 mins, then reduce the temperature to 180C/160C fan/gas 4. Continue to bake for 35-40 mins until the filling has just set.\r\nLeave to cool, then remove the pie from the tin. Mix the remaining cinnamon with the icing sugar and dust over the pie. Serve chilled.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/usuqtp1511385394.jpg",
      "tags": "Halloween,Pie,Desert",
      "youtube": "https://www.youtube.com/watch?v=hpapqEeb36k",
      "source": "https://www.bbcgoodfood.com/recipes/1742633/pumpkin-pie",
      "ingredients": [
        {
          "ingredient": "Pumpkin",
          "measure": "750g"
        },
        {
          "ingredient": "Shortcrust Pastry",
          "measure": "350g"
        },
        {
          "ingredient": "Plain Flour",
          "measure": "Dusting"
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "140g"
        },
        {
          "ingredient": "Salt",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Nutmeg",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Cinnamon",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Eggs",
          "measure": "2 Beaten "
        },
        {
          "ingredient": "Butter",
          "measure": "25g"
        },
        {
          "ingredient": "Milk",
          "measure": "175g"
        },
        {
          "ingredient": "Icing Sugar",
          "measure": "1 tblsp "
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52816",
      "meal": "Roasted Eggplant With Tahini, Pine Nuts, and Lentils",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "American",
      "instructions": "\r\nFor the Lentils: Adjust oven rack to center position and preheat oven to 450°F to prepare for roasting eggplant. Meanwhile, heat 2 tablespoons olive oil in a medium saucepan over medium heat until shimmering. Add carrots, celery, and onion and cook, stirring, until softened but not browned, about 4 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds. Add lentils, bay leaves, stock or water, and a pinch of salt. Bring to a simmer, cover with the lid partially ajar, and cook until lentils are tender, about 30 minutes. (Top up with water if lentils are at any point not fully submerged.) Remove lid, stir in vinegar, and reduce until lentils are moist but not soupy. Season to taste with salt and pepper, cover, and keep warm until ready to serve.\r\n\r\n2.\r\nFor the Eggplant: While lentils cook, cut each eggplant in half. Score flesh with the tip of a paring knife in a cross-hatch pattern at 1-inch intervals. Transfer to a foil-lined rimmed baking sheet, cut side up, and brush each eggplant half with 1 tablespoon oil, letting each brushstroke be fully absorbed before brushing with more. Season with salt and pepper. Place a rosemary sprig on top of each one. Transfer to oven and roast until completely tender and well charred, 25 to 35 minutes. Remove from oven and discard rosemary.\r\n\r\n3.\r\nTo Serve: Heat 2 tablespoons olive oil and pine nuts in a medium skillet set over medium heat. Cook, tossing nuts frequently, until golden brown and aromatic, about 4 minutes. Transfer to a bowl to halt cooking. Stir half of parsley and rosemary into lentils and transfer to a serving platter. Arrange eggplant halves on top. Spread a few tablespoons of tahini sauce over each eggplant half and sprinkle with pine nuts. Sprinkle with remaining parsley and rosemary, drizzle with additional olive oil, and serve.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/ysqrus1487425681.jpg",
      "tags": "Vegetarian,Pulse,Nutty",
      "youtube": "https://www.youtube.com/watch?v=HkywCtna9t0",
      "source": "http://www.seriouseats.com/recipes/2016/03/roasted-eggplant-tahini-pine-nut-lentil-vegan-experience-recipe.html",
      "ingredients": [
        {
          "ingredient": "Olive Oil",
          "measure": "2 tablespoons"
        },
        {
          "ingredient": "Carrots",
          "measure": "2 small cut into chunks"
        },
        {
          "ingredient": "Celery",
          "measure": "2 small stalks"
        },
        {
          "ingredient": "Onion",
          "measure": "1 medium finely diced"
        },
        {
          "ingredient": "Garlic",
          "measure": "6 medium cloves sliced"
        },
        {
          "ingredient": "Brown Lentils",
          "measure": "12 ounces (340g)"
        },
        {
          "ingredient": "Bay Leaves",
          "measure": "2"
        },
        {
          "ingredient": "Water",
          "measure": "4 cups"
        },
        {
          "ingredient": "Salt",
          "measure": "Pinch"
        },
        {
          "ingredient": "Apple Cider Vinegar",
          "measure": "2 teaspoons (10ml)"
        },
        {
          "ingredient": "Pepper",
          "measure": "Pinch"
        },
        {
          "ingredient": "Egg Plants",
          "measure": "2 large"
        },
        {
          "ingredient": "Rosemary",
          "measure": "4 sprigs"
        },
        {
          "ingredient": "Pine nuts",
          "measure": "1/4 cup "
        },
        {
          "ingredient": "Parsley",
          "measure": "2 tablespoons"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "52861",
      "meal": "Peanut Butter Cheesecake",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "American",
      "instructions": "Oil and line a 20cm round loose- bottomed cake tin with cling film, making it as smooth as possible. Melt the butter in a pan. Crush the biscuits by bashing them in a bag with a rolling pin, then stir them into the butter until very well coated. Press the mixture firmly into the base of the tin and chill.\r\nSoak the gelatine in water while you make the filling. Tip the ricotta into a bowl, then beat in the peanut butter and syrup. Ricotta has a slightly grainy texture so blitz until smooth with a stick blender for a smoother texture if you prefer.\r\nTake the soaked gelatine from the water and squeeze dry. Put it into a pan with the milk and heat very gently until the gelatine dissolves. Beat into the peanut mixture, then tip onto the biscuit base. Chill until set.\r\nTo freeze, leave in the tin and as soon as it is solid, cover the surface with cling film, then wrap the tin with cling film and foil.\r\nTo defrost, thaw in the fridge overnight.\r\nTo serve, carefully remove from the tin. Whisk the cream with the sugar until it holds its shape, then spread on top of the cheesecake and scatter with the peanut brittle.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/qtuuys1511387068.jpg",
      "tags": "Cake,Desert,Treat,UnHealthy,Speciality",
      "youtube": "https://www.youtube.com/watch?v=QSTsturcyL0",
      "source": "https://www.bbcgoodfood.com/recipes/1759649/peanut-butter-cheesecake",
      "ingredients": [
        {
          "ingredient": "Butter",
          "measure": "50g"
        },
        {
          "ingredient": "Peanut Cookies",
          "measure": "175g"
        },
        {
          "ingredient": "Gelatine Leafs",
          "measure": "5"
        },
        {
          "ingredient": "Ricotta",
          "measure": "500g"
        },
        {
          "ingredient": "Peanut Butter",
          "measure": "175g"
        },
        {
          "ingredient": "Golden Syrup",
          "measure": "175g"
        },
        {
          "ingredient": "Milk",
          "measure": "150ml"
        },
        {
          "ingredient": "Double Cream",
          "measure": "275ml"
        },
        {
          "ingredient": "Light Brown Soft Sugar",
          "measure": "2 tblsp "
        },
        {
          "ingredient": "Peanut Brittle",
          "measure": "Crushed"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52775",
      "meal": "Vegan Lasagna",
      "drinkAlternate": null,
      "category": "Vegan",
      "area": "Italian",
      "instructions": "1) Preheat oven to 180 degrees celcius. \r\n2) Boil vegetables for 5-7 minutes, until soft. Add lentils and bring to a gentle simmer, adding a stock cube if desired. Continue cooking and stirring until the lentils are soft, which should take about 20 minutes. \r\n3) Blanch spinach leaves for a few minutes in a pan, before removing and setting aside. \r\n4) Top up the pan with water and cook the lasagne sheets. When cooked, drain and set aside.\r\n5) To make the sauce, melt the butter and add the flour, then gradually add the soya milk along with the mustard and the vinegar. Cook and stir until smooth and then assemble the lasagne as desired in a baking dish. \r\n6) Bake in the preheated oven for about 25 minutes.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/rvxxuy1468312893.jpg",
      "tags": "Vegan,Pasta",
      "youtube": "https://www.youtube.com/watch?v=VU8cXvlGbvc",
      "source": null,
      "ingredients": [
        {
          "ingredient": "green red lentils",
          "measure": "1 cups"
        },
        {
          "ingredient": "Carrots",
          "measure": "1"
        },
        {
          "ingredient": "onion",
          "measure": "1"
        },
        {
          "ingredient": "zucchini",
          "measure": "1 small"
        },
        {
          "ingredient": "coriander",
          "measure": "sprinking"
        },
        {
          "ingredient": "spinach",
          "measure": "150g"
        },
        {
          "ingredient": "lasagne sheets",
          "measure": "10"
        },
        {
          "ingredient": "vegan butter",
          "measure": "35g"
        },
        {
          "ingredient": "flour",
          "measure": "4 tablespoons"
        },
        {
          "ingredient": "soya milk",
          "measure": "300ml"
        },
        {
          "ingredient": "mustard",
          "measure": "1.5 teaspoons"
        },
        {
          "ingredient": "vinegar",
          "measure": "1 teaspoon"
        }
      ],
      "categoryId": "11"
    },
    {
      "id": "52914",
      "meal": "Boulangère Potatoes",
      "drinkAlternate": null,
      "category": "Side",
      "area": "French",
      "instructions": "Heat oven to 200C/fan 180C/gas 6. Fry the onions and thyme sprigs in the oil until softened and lightly coloured (about 5 mins).\r\nSpread a layer of potatoes over the base of a 1.5-litre oiled gratin dish. Sprinkle over a few onions (see picture, above) and continue layering, finishing with a layer of potatoes. Pour over the stock and bake for 50-60 mins until the potatoes are cooked and the top is golden and crisp.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/qywups1511796761.jpg",
      "tags": "SideDish",
      "youtube": "https://www.youtube.com/watch?v=gcXPruv1Mjg",
      "source": "https://www.bbcgoodfood.com/recipes/5056/boulangre-potatoes",
      "ingredients": [
        {
          "ingredient": "Onions",
          "measure": "2 finely chopped"
        },
        {
          "ingredient": "Thyme",
          "measure": "sprigs of fresh"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Potatoes",
          "measure": "1.5kg"
        },
        {
          "ingredient": "Vegetable Stock",
          "measure": "425g"
        }
      ],
      "categoryId": "9"
    },
    {
      "id": "52863",
      "meal": "Vegetarian Casserole",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "British",
      "instructions": "Heat the oil in a large, heavy-based pan. Add the onions and cook gently for 5 – 10 mins until softened.\r\nAdd the garlic, spices, dried thyme, carrots, celery and peppers and cook for 5 minutes.\r\nAdd the tomatoes, stock, courgettes and fresh thyme and cook for 20 - 25 minutes.\r\nTake out the thyme sprigs. Stir in the lentils and bring back to a simmer. Serve with wild and white basmati rice, mash or quinoa.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/vptwyt1511450962.jpg",
      "tags": "Casserole,Vegetarian",
      "youtube": "https://www.youtube.com/watch?v=oHmKE9mWtWM",
      "source": "https://www.bbcgoodfood.com/recipes/1993645/vegetarian-casserole",
      "ingredients": [
        {
          "ingredient": "Rapeseed Oil",
          "measure": "1"
        },
        {
          "ingredient": "Onion",
          "measure": "1"
        },
        {
          "ingredient": "Garlic",
          "measure": "3 cloves"
        },
        {
          "ingredient": "Paprika",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Cumin",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Thyme",
          "measure": "1 tblsp "
        },
        {
          "ingredient": "Carrots",
          "measure": "3 Medium"
        },
        {
          "ingredient": "Celery",
          "measure": "2 small stalks"
        },
        {
          "ingredient": "Red Pepper",
          "measure": "1"
        },
        {
          "ingredient": "Yellow Pepper",
          "measure": "1"
        },
        {
          "ingredient": "Tomato",
          "measure": "2 x 400g tins"
        },
        {
          "ingredient": "Vegetable Stock Cube",
          "measure": "250ml"
        },
        {
          "ingredient": "Courgettes",
          "measure": "2 sliced"
        },
        {
          "ingredient": "Thyme",
          "measure": "2 sprigs"
        },
        {
          "ingredient": "Lentils",
          "measure": "250g"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "53030",
      "meal": "Feteer Meshaltet",
      "drinkAlternate": null,
      "category": "Side",
      "area": "Egyptian",
      "instructions": "Mix the flour and salt then pour one cup of water and start kneading.\r\nIf you feel the dough is still not coming together or too dry, gradually add the remaining water until you get a dough that is very elastic so that when you pull it and it won’t be torn.\r\nLet the dough rest for just 10 minutes then divide the dough into 6-8 balls depending on the size you want for your feteer.\r\nWarm up the butter/ghee or oil you are using and pour into a deep bowl.\r\nImmerse the dough balls into the warm butter. Let it rest for 15 to 20 minutes.\r\nPreheat oven to 550F.\r\nStretch the first ball with your hands on a clean countertop. Stretch it as thin as you can, the goal here is to see your countertop through the dough.\r\nFold the dough over itself to form a square brushing in between folds with the butter mixture.\r\nSet aside and start making the next ball.\r\nStretch the second one thin as we have done for the first ball.\r\nPlace the previous one on the middle seam side down. Fold the outer one over brushing with more butter mixture as you fold. Set aside.\r\nKeep doing this for the third and fourth balls. Now we have one ready, place on a 10 inch baking/pie dish seam side down and brush the top with more butter.\r\nRepeat for the remaining 4 balls to make a second one. With your hands lightly press the folded feteer to spread it on the baking dish.\r\nPlace in preheated oven for 10 minutes when the feteer starts puffing turn on the broiler to brown the top.\r\nWhen it is done add little butter on top and cover so it won’t get dry.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/9f4z6v1598734293.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=-mW1unsVhFU",
      "source": "https://amiraspantry.com/egyptian-feteer-meshaltet/",
      "ingredients": [
        {
          "ingredient": "Flour",
          "measure": "4 cups "
        },
        {
          "ingredient": "Water",
          "measure": "1 1/2 cups "
        },
        {
          "ingredient": "Salt",
          "measure": "1/4 tsp"
        },
        {
          "ingredient": "Unsalted Butter",
          "measure": "1 cup "
        },
        {
          "ingredient": "Olive Oil",
          "measure": "1/4 cup"
        }
      ],
      "categoryId": "9"
    },
    {
      "id": "53073",
      "meal": "Eggplant Adobo",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "Filipino",
      "instructions": "1.\tSlice 1 lb. small Japanese or Italian eggplant (about 3) into quarters lengthwise, then cut crosswise into 2\"-wide pieces. Place in a medium bowl. Add 1 Tbsp. sugar, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ½ tsp. freshly ground black pepper. Toss to evenly coat eggplant and let sit at room temperature at least 20 minutes and up to 2 hours.\r\n2.\tPeel and thinly slice 8 garlic cloves. Add 3 Tbsp. vegetable oil and half of garlic to a medium Dutch oven or other heavy pot. Cook over medium-high heat, stirring constantly with a wooden spoon, until light golden and crisp, about 5 minutes. Using a slotted spoon, transfer garlic chips to a plate; season lightly with salt.\r\n3. Place 4 oz. ground pork in same pot and break up into small pieces with wooden spoon. Season with ¼ tsp. Diamond Crystal or Morton kosher salt and cook, undisturbed, until deeply browned underneath, about 5 minutes. Using a slotted spoon, transfer to another plate, leaving fat behind in the pot.\r\n4. Place eggplant on a clean kitchen towel and blot away any moisture the salt has drawn out.\r\n5. Working in batches and adding more oil if needed, cook eggplant in the same pot until lightly browned, about 3 minutes per side. Transfer to a plate with pork.\r\n6. Pour 1½ cups of water into the pot and scrape up browned bits from the bottom with a wooden spoon. Add remaining garlic, 3 Tbsp. coconut vinegar or unseasoned rice vinegar, 2 Tbsp. soy sauce, 2 bay leaves, 1 tsp. freshly ground black pepper, and remaining 1 Tbsp. sugar. Bring to a simmer, then return pork and eggplant to pot. Reduce heat to medium-low, partially cover, and simmer until eggplant is tender and silky and sauce is reduced by half, 20–25 minutes. Taste and season with more salt and pepper and add a little more sugar if needed.\r\n7. Top with garlic chips and serve with cooked white rice.\r\n",
      "mealThumb": "https://www.themealdb.com/images/media/meals/y7h0lq1683208991.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=pKXACYjwMns",
      "source": "https://salu-salo.com/eggplant-adobo/",
      "ingredients": [
        {
          "ingredient": "Egg Plants",
          "measure": "1 lb"
        },
        {
          "ingredient": "Sugar",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Salt",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Pepper",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Garlic",
          "measure": "1 whole"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Ground Pork",
          "measure": "4 oz "
        },
        {
          "ingredient": "Rice Vinegar",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Soy Sauce",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Bay Leaf",
          "measure": "2"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "52808",
      "meal": "Lamb Rogan josh",
      "drinkAlternate": null,
      "category": "Lamb",
      "area": "Indian",
      "instructions": "\r\nPut the onions in a food processor and whizz until very finely chopped. Heat the oil in a large heavy-based pan, then fry the onion with the lid on, stirring every now and then, until it is really golden and soft. Add the garlic and ginger, then fry for 5 mins more.\r\nTip the curry paste, all the spices and the bay leaves into the pan, with the tomato purée. Stir well over the heat for about 30 secs, then add the meat and 300ml water. Stir to mix, turn down the heat, then add the yogurt.\r\nCover the pan, then gently simmer for 40-60 mins until the meat is tender and the sauce nice and thick. Serve scattered with coriander, with plain basmati or pilau rice.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/vvstvq1487342592.jpg",
      "tags": "Curry,Spicy,Alcoholic",
      "youtube": "https://www.youtube.com/watch?v=NZVo32n7iS8",
      "source": "http://www.bbcgoodfood.com/recipes/9643/onepan-rogan-josh",
      "ingredients": [
        {
          "ingredient": "Onion",
          "measure": "2 quartered"
        },
        {
          "ingredient": "Sunflower Oil",
          "measure": "4 tbsp"
        },
        {
          "ingredient": "Garlic",
          "measure": "4 cloves"
        },
        {
          "ingredient": "Ginger",
          "measure": "Thumb sized peeled and very finely grated"
        },
        {
          "ingredient": "Madras Paste",
          "measure": "2 tbsp"
        },
        {
          "ingredient": "Paprika",
          "measure": "2 tsp"
        },
        {
          "ingredient": "cinnamon stick",
          "measure": "1"
        },
        {
          "ingredient": "Cardamom",
          "measure": "6 bashed to break shells"
        },
        {
          "ingredient": "Cloves",
          "measure": "4"
        },
        {
          "ingredient": "Bay Leaf",
          "measure": "2"
        },
        {
          "ingredient": "Tomato Purée",
          "measure": "1 tbsp"
        },
        {
          "ingredient": "Lamb",
          "measure": "1kg cubed"
        },
        {
          "ingredient": "Greek yogurt",
          "measure": "150ml"
        },
        {
          "ingredient": "Coriander",
          "measure": "Garnish chopped "
        }
      ],
      "categoryId": "4"
    },
    {
      "id": "53042",
      "meal": "Portuguese prego with green piri-piri",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "Portuguese",
      "instructions": "STEP 1\r\n\r\nRub the garlic over the steaks then put in a sandwich bag and tip in the olive oil, sherry vinegar and parsley stalks. Smoosh everything together, then use a rolling pin to bash the steaks a few times. Leave for 1-2 hours.\r\n\r\nSTEP 2\r\n\r\nTo make the sauce, put all the ingredients into a blender with 1 tbsp water and whizz until as smooth as possible. This will make more than you’ll need for the recipe but will keep for a week in an airtight jar.\r\n\r\nSTEP 3\r\n\r\nHeat a griddle or frying pan to high. Brush away the garlic and parsley stalks from the steaks and season well. Sear the steaks for 2 minutes on each side then rest on a plate. Put the ciabatta halves onto the plate, toasted-side down, to soak up any juices.\r\n\r\nSTEP 4\r\n\r\nSlice the steaks then stuff into the rolls with the green sauce and rocket.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/ewcikl1614348364.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=FbIKfcDEPLA",
      "source": "https://www.olivemagazine.com/recipes/meat-and-poultry/portuguese-prego-with-green-piri-piri/",
      "ingredients": [
        {
          "ingredient": "Garlic",
          "measure": "1 clove"
        },
        {
          "ingredient": "Beef Fillet",
          "measure": "2 small"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Vinegar",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Parsley",
          "measure": "Leaves"
        },
        {
          "ingredient": "Ciabatta",
          "measure": "2"
        },
        {
          "ingredient": "Rocket",
          "measure": "2 handfulls"
        },
        {
          "ingredient": "Basil Leaves",
          "measure": "Small bunch"
        },
        {
          "ingredient": "Parsley",
          "measure": "Small bunch"
        },
        {
          "ingredient": "Jalapeno",
          "measure": "1"
        },
        {
          "ingredient": "Vinegar",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Spring Onions",
          "measure": "2 chopped"
        },
        {
          "ingredient": "Garlic",
          "measure": "1/2 "
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "1/2 tsp"
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "53025",
      "meal": "Ful Medames",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "Egyptian",
      "instructions": "As the cooking time varies depending on the quality and age of the beans, it is good to cook them in advance and to reheat them when you are ready to serve. Cook the drained beans in a fresh portion of unsalted water in a large saucepan with the lid on until tender, adding water to keep them covered, and salt when the beans have softened. They take 2–2 1/2 hours of gentle simmering. When the beans are soft, let the liquid reduce. It is usual to take out a ladle or two of the beans and to mash them with some of the cooking liquid, then stir this back into the beans. This is to thicken the sauce.\r\nServe the beans in soup bowls sprinkled with chopped parsley and accompanied by Arab bread.\r\nPass round the dressing ingredients for everyone to help themselves: a bottle of extra-virgin olive oil, the quartered lemons, salt and pepper, a little saucer with the crushed garlic, one with chili-pepper flakes, and one with ground cumin.\r\nThe beans are eaten gently crushed with the fork, so that they absorb the dressing.\r\nOptional Garnishes\r\nPeel hard-boiled eggs—1 per person—to cut up in the bowl with the beans.\r\nTop the beans with a chopped cucumber-and-tomato salad and thinly sliced mild onions or scallions. Otherwise, pass round a good bunch of scallions and quartered tomatoes and cucumbers cut into sticks.\r\nServe with tahina cream sauce (page 65) or salad (page 67), with pickles and sliced onions soaked in vinegar for 30 minutes.\r\nAnother way of serving ful medames is smothered in a garlicky tomato sauce (see page 464).\r\nIn Syria and Lebanon, they eat ful medames with yogurt or feta cheese, olives, and small cucumbers.\r\nVariations\r\nA traditional way of thickening the sauce is to throw a handful of red lentils (1/4 cup) into the water at the start of the cooking.\r\nIn Iraq, large brown beans are used instead of the small Egyptian ones, in a dish called badkila, which is also sold for breakfast in the street.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/lvn2d51598732465.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=ixpCabILuxw",
      "source": "https://www.epicurious.com/recipes/food/views/ful-medames-352993",
      "ingredients": [
        {
          "ingredient": "Broad Beans",
          "measure": "2 cups "
        },
        {
          "ingredient": "Parsley",
          "measure": "1/3 cup"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "Dash"
        },
        {
          "ingredient": "Lemons",
          "measure": "3"
        },
        {
          "ingredient": "Garlic Clove",
          "measure": "4"
        },
        {
          "ingredient": "Cumin",
          "measure": "Sprinking"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "52892",
      "meal": "Treacle Tart",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "British",
      "instructions": "First make the short crust pastry: measure the flour into a large bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs (alternatively, this can be done in a food processor). Add about three tablespoons of cold water and mix to a firm dough, wrap in cling film and chill in the fridge for about 20 minutes.\r\nPreheat the oven to 200C/400F/Gas 6 and put a heavy baking tray in the oven to heat up. Grease a deep 18cm/7in loose-bottomed fluted flan tin with butter.\r\nRemove about 150g/5½oz of pastry from the main ball and set aside for the lattice top.\r\nRoll the rest of the pastry out thinly on a lightly floured work surface and line the prepared flan tin with the pastry.\r\nPrick the base with a fork, to stop the base rising up during baking.\r\nPlace the reserved pastry for the lattice top on cling film and roll out thinly. Egg wash the pastry and set aside to chill in the fridge (the cling film makes it easier to move about). Do not cut into strips at this stage. Do not egg wash the strips once they are on the tart as it will drip into the treacle mixture.\r\nTo make the filling, heat the syrup gently in a large pan but do not boil.\r\nOnce melted, add the breadcrumbs, lemon juice and zest to the syrup. (You can add less lemon if you would prefer less citrus taste.) If the mixture looks runny, add a few more breadcrumbs.\r\nPour the syrup mixture into the lined tin and level the surface.\r\nRemove the reserved pastry from the fridge and cut into long strips, 1cm/½in wide. Make sure they are all longer than the edges of the tart tin.\r\nEgg wash the edge of the pastry in the tin, and start to make the woven laying lattice pattern over the mixture, leave the strips hanging over the edge of the tin.\r\nOnce the lattice is in place, use the tin edge to cut off the strips by pressing down with your hands, creating a neat finish.\r\nBake on the pre-heated baking tray in the hot oven for about 10 minutes until the pastry has started to colour, and then reduce the oven temperature to 180C/350F/Gas 4. If at this stage the lattice seems to be getting too dark brown, cover the tart with tin foil.\r\nBake for a further 25-30 minutes until the pastry is golden-brown and the filling set.\r\nRemove the tart from the oven and leave to firm up in the tin. Serve warm or cold.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wprvrw1511641295.jpg",
      "tags": "Tart",
      "youtube": "https://www.youtube.com/watch?v=YMmgKCNcqwI",
      "source": "https://www.bbc.co.uk/food/recipes/mary_berrys_treacle_tart_28524",
      "ingredients": [
        {
          "ingredient": "Plain Flour",
          "measure": "250g"
        },
        {
          "ingredient": "Butter",
          "measure": "135g"
        },
        {
          "ingredient": "Golden Syrup",
          "measure": "400g"
        },
        {
          "ingredient": "Breadcrumbs",
          "measure": "150g"
        },
        {
          "ingredient": "Lemons",
          "measure": "Zest of 2"
        },
        {
          "ingredient": "Eggs",
          "measure": "1 beaten"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "53036",
      "meal": "Boxty Breakfast",
      "drinkAlternate": null,
      "category": "Pork",
      "area": "Irish",
      "instructions": "STEP 1\r\nBefore you start, put your oven on its lowest setting, ready to keep things warm. Peel the potatoes, grate 2 of them, then set aside. Cut the other 2 into large chunks, then boil for 10-15 mins or until tender. Meanwhile, squeeze as much of the liquid from the grated potatoes as you can using a clean tea towel. Mash the boiled potatoes, then mix with the grated potato, spring onions and flour.\r\n\r\nSTEP 2\r\nWhisk the egg white in a large bowl until it holds soft peaks. Fold in the buttermilk, then add the bicarbonate of soda. Fold into the potato mix.\r\n\r\nSTEP 3\r\nHeat a large non-stick frying pan over a medium heat, then add 1 tbsp butter and some of the oil. Drop 3-4 spoonfuls of the potato mixture into the pan, then gently cook for 3-5 mins on each side until golden and crusty. Keep warm on a plate in the oven while you cook the next batch, adding more butter and oil to the pan before you do so. You will get 16 crumpet-size boxty from the mix. Can be made the day ahead, drained on kitchen paper, then reheated in a low oven for 20 mins.\r\n\r\nSTEP 4\r\nHeat the grill to medium and put the tomatoes in a heavy-based pan. Add a good knob of butter and a little oil, then fry for about 5 mins until softened. Grill the bacon, then pile onto a plate and keep warm. Stack up the boxty, bacon and egg, and serve the tomatoes on the side.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/naqyel1608588563.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=80W0mCFDIP0",
      "source": "https://www.bbcgoodfood.com/recipes/boxty-bacon-eggs-tomatoes",
      "ingredients": [
        {
          "ingredient": "Potatoes",
          "measure": "4 large"
        },
        {
          "ingredient": "Spring Onions",
          "measure": "1  bunch"
        },
        {
          "ingredient": "Plain Flour",
          "measure": "100g "
        },
        {
          "ingredient": "Egg White",
          "measure": "1"
        },
        {
          "ingredient": "Milk",
          "measure": "150ml"
        },
        {
          "ingredient": "Bicarbonate Of Soda",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Butter",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Cherry Tomatoes",
          "measure": "6"
        },
        {
          "ingredient": "Bacon",
          "measure": "12"
        },
        {
          "ingredient": "Egg",
          "measure": "6"
        }
      ],
      "categoryId": "7"
    },
    {
      "id": "52965",
      "meal": "Breakfast Potatoes",
      "drinkAlternate": null,
      "category": "Breakfast",
      "area": "Canadian",
      "instructions": "Before you do anything, freeze your bacon slices that way when you're ready to prep, it'll be so much easier to chop!\r\nWash the potatoes and cut medium dice into square pieces. To prevent any browning, place the already cut potatoes in a bowl filled with water.\r\nIn the meantime, heat 1-2 tablespoons of oil in a large skillet over medium-high heat. Tilt the skillet so the oil spreads evenly.\r\nOnce the oil is hot, drain the potatoes and add to the skillet. Season with salt, pepper, and Old Bay as needed.\r\nCook for 10 minutes, stirring the potatoes often, until brown. If needed, add a tablespoon more of oil.\r\nChop up the bacon and add to the potatoes. The bacon will start to render and the fat will begin to further cook the potatoes. Toss it up a bit! The bacon will take 5-6 minutes to crisp.\r\nOnce the bacon is cooked, reduce the heat to medium-low, add the minced garlic and toss. Season once more. Add dried or fresh parsley. Control heat as needed.\r\nLet the garlic cook until fragrant, about one minute.\r\nJust before serving, drizzle over the maple syrup and toss. Let that cook another minute, giving the potatoes a caramelized effect.\r\nServe in a warm bowl with a sunny side up egg!",
      "mealThumb": "https://www.themealdb.com/images/media/meals/1550441882.jpg",
      "tags": "Breakfast,Brunch",
      "youtube": "https://www.youtube.com/watch?v=BoD0TIO9nE4",
      "source": "http://www.vodkaandbiscuits.com/2014/03/06/bangin-breakfast-potatoes/",
      "ingredients": [
        {
          "ingredient": "Potatoes",
          "measure": "3 Medium"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Bacon",
          "measure": "2 strips"
        },
        {
          "ingredient": "Garlic Clove",
          "measure": "Minced"
        },
        {
          "ingredient": "Maple Syrup",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Parsley",
          "measure": "Garnish"
        },
        {
          "ingredient": "Salt",
          "measure": "Pinch"
        },
        {
          "ingredient": "Pepper",
          "measure": "Pinch"
        },
        {
          "ingredient": "Allspice",
          "measure": "To taste"
        }
      ],
      "categoryId": "13"
    },
    {
      "id": "52805",
      "meal": "Lamb Biryani",
      "drinkAlternate": null,
      "category": "Lamb",
      "area": "Indian",
      "instructions": "Grind the cashew, poppy seeds and cumin seeds into a smooth paste, using as little water as possible. Set aside. \r\n\r\nDeep fry the sliced onions when it is hot. Don’t overcrowd the oil. When the onions turn light brown, remove from oil and drain on paper towel. The fried onion will crisp up as it drains. Also fry the cashewnuts till golden brown. Set aside.\r\n\r\nWash the rice and soak in water for twenty minutes.\r\nMeanwhile, take a big wide pan, add oil in medium heat, add the sliced onions, add the blended paste, to it add the green chillies, ginger garlic paste and garlic and fry for a minute.\r\nThen add the tomatoes and sauté them well till they are cooked and not mushy.\r\n\r\nThen to it add the red chilli powder, biryani powder, mint, coriander leaves and sauté them well.\r\nAdd the yogurt and mix well. I always move the skillet away from the heat when adding yogurt which prevents it from curdling.\r\n\r\nNow after returning the skillet back to the stove, add the washed lamb and salt and ½ cup water and mix well. Cook for 1 hour and cook it covered in medium low heat or put it in a pressure cooker for 6 whistles. If the water is not drained totally, heat it by keeping it open.\r\n\r\nTake another big pan, add thrice the cup of rice you use, and boil it. When it is boiling high, add the rice, salt and jeera and mix well. After 7 minutes exact or when the rice is 80% done. Switch off and drain the rice.\r\n\r\nNow, the layering starts. To the lamb, pat and level it. Add the drained hot rice on the top of it. Garnish with fried onions, ghee, mint, coriander leaves and saffron dissolved in milk.\r\n\r\nCover the dish and bake in a 350f oven for 15 minutes or till the cooked but not mushy. Or cook in the stove medium heat for 12 minutes and lowest heat for 5 minutes. And switch off. Mix and serve hot!\r\nNotes\r\n1. If you are cooking in oven, do make sure to cook in a big oven safe pan and cover it tight and then keep in oven for the final step.\r\n2. You can skip biryani masala if you don’t have and add just garam masala (1 tsp and red chilli powder – 3 tsp instead of 1 tsp)\r\n3. If it is spicy in the end, squeeze some lemon, it will reduce the heat and enhance the flavors also.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/xrttsx1487339558.jpg",
      "tags": "Curry,Meat",
      "youtube": "https://www.youtube.com/watch?v=r7SYVSG5nxo",
      "source": "http://www.relishthebite.com/restaurant-style-lamb-biryani/",
      "ingredients": [
        {
          "ingredient": "Cashew nuts",
          "measure": "12"
        },
        {
          "ingredient": "Khus khus",
          "measure": "½ tbsp"
        },
        {
          "ingredient": "Cumin seeds",
          "measure": "½ tbsp"
        },
        {
          "ingredient": "Onions",
          "measure": "3 sliced thinly"
        },
        {
          "ingredient": "Ginger garlic paste",
          "measure": "2 tsp"
        },
        {
          "ingredient": "Garlic",
          "measure": "4 whole"
        },
        {
          "ingredient": "Mint",
          "measure": "Leaves"
        },
        {
          "ingredient": "Cilantro",
          "measure": "Leaves"
        },
        {
          "ingredient": "Saffron",
          "measure": "½ tsp dissolved in ½ cup warm milk"
        },
        {
          "ingredient": "Ghee",
          "measure": "2 tbsp"
        },
        {
          "ingredient": "Basmati rice",
          "measure": "2 Cups"
        },
        {
          "ingredient": "Full fat yogurt",
          "measure": "½ cup"
        },
        {
          "ingredient": "Cumin Seeds",
          "measure": "1 tbsp"
        },
        {
          "ingredient": "Bay leaf",
          "measure": "½"
        },
        {
          "ingredient": "Cinnamon",
          "measure": "1 thin piece"
        },
        {
          "ingredient": "Cloves",
          "measure": "3"
        },
        {
          "ingredient": "Cardamom",
          "measure": "2"
        },
        {
          "ingredient": "Lamb",
          "measure": "1 lb"
        },
        {
          "ingredient": "Red Chilli powder",
          "measure": "1 tsp"
        },
        {
          "ingredient": "Biryani masala",
          "measure": "1 tbsp"
        }
      ],
      "categoryId": "4"
    },
    {
      "id": "52962",
      "meal": "Salmon Eggs Eggs Benedict",
      "drinkAlternate": null,
      "category": "Breakfast",
      "area": "American",
      "instructions": "First make the Hollandaise sauce. Put the lemon juice and vinegar in a small bowl, add the egg yolks and whisk with a balloon whisk until light and frothy. Place the bowl over a pan of simmering water and whisk until mixture thickens. Gradually add the butter, whisking constantly until thick – if it looks like it might be splitting, then whisk off the heat for a few mins. Season and keep warm.\r\n\r\nTo poach the eggs, bring a large pan of water to the boil and add the vinegar. Lower the heat so that the water is simmering gently. Stir the water so you have a slight whirlpool, then slide in the eggs one by one. Cook each for about 4 mins, then remove with a slotted spoon.\r\n\r\nLightly toast and butter the muffins, then put a couple of slices of salmon on each half. Top each with an egg, spoon over some Hollandaise and garnish with chopped chives.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/1550440197.jpg",
      "tags": "Bun,Brunch",
      "youtube": "https://www.youtube.com/watch?v=Woiiet4vQ58",
      "source": "https://www.bbcgoodfood.com/recipes/73606/eggs-benedict-with-smoked-salmon-and-chives",
      "ingredients": [
        {
          "ingredient": "Eggs",
          "measure": "4"
        },
        {
          "ingredient": "White Wine Vinegar",
          "measure": "2 tbs"
        },
        {
          "ingredient": "English Muffins",
          "measure": "2"
        },
        {
          "ingredient": "Butter",
          "measure": "To serve"
        },
        {
          "ingredient": "Smoked Salmon",
          "measure": "8 slices"
        },
        {
          "ingredient": "Lemon Juice",
          "measure": "2 tsp"
        },
        {
          "ingredient": "White Wine Vinegar",
          "measure": "2 tsp"
        },
        {
          "ingredient": "Egg",
          "measure": "3 Yolkes"
        },
        {
          "ingredient": "Unsalted Butter",
          "measure": "125g"
        }
      ],
      "categoryId": "13"
    },
    {
      "id": "52770",
      "meal": "Spaghetti Bolognese",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "Italian",
      "instructions": "Put the onion and oil in a large pan and fry over a fairly high heat for 3-4 mins. Add the garlic and mince and fry until they both brown. Add the mushrooms and herbs, and cook for another couple of mins.\r\n\r\nStir in the tomatoes, beef stock, tomato ketchup or purée, Worcestershire sauce and seasoning. Bring to the boil, then reduce the heat, cover and simmer, stirring occasionally, for 30 mins.\r\n\r\nMeanwhile, cook the spaghetti in a large pan of boiling, salted water, according to packet instructions. Drain well, run hot water through it, put it back in the pan and add a dash of olive oil, if you like, then stir in the meat sauce. Serve in hot bowls and hand round Parmesan cheese, for sprinkling on top.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/sutysw1468247559.jpg",
      "tags": "Pasta,Meat",
      "youtube": "https://www.youtube.com/watch?v=-gF8d-fitkU",
      "source": null,
      "ingredients": [
        {
          "ingredient": "onions",
          "measure": "2"
        },
        {
          "ingredient": "olive oil",
          "measure": "1tbsp"
        },
        {
          "ingredient": "garlic",
          "measure": "1 clove"
        },
        {
          "ingredient": "lean minced beef",
          "measure": "500g"
        },
        {
          "ingredient": "mushrooms",
          "measure": "90g"
        },
        {
          "ingredient": "dried oregano",
          "measure": "1tsp"
        },
        {
          "ingredient": "tomatoes",
          "measure": "400g can"
        },
        {
          "ingredient": "hot beef stock",
          "measure": "300ml"
        },
        {
          "ingredient": "tomato puree",
          "measure": "1tbsp"
        },
        {
          "ingredient": "worcestershire sauce",
          "measure": "1tbsp"
        },
        {
          "ingredient": "spaghetti",
          "measure": "350g"
        },
        {
          "ingredient": "parmesan",
          "measure": "Topping"
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "53058",
      "meal": "Croatian Bean Stew",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "Croatian",
      "instructions": "Heat the oil in a pan. Add the chopped vegetables and sauté until tender. Take a pot, empty the beans together with the vegetables into it, put the sausages inside and cook for further 20 minutes on a low heat. Or, put it in an oven and bake it at a temperature of 180ºC/350ºF for 30 minutes. This dish is even better reheated the next day.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/tnwy8m1628770384.jpg",
      "tags": "Warming,Soup,Beans",
      "youtube": "https://www.youtube.com/watch?v=mrjnQal3S1A",
      "source": "https://www.visit-croatia.co.uk/croatian-cuisine/croatian-recipes/",
      "ingredients": [
        {
          "ingredient": "Cannellini Beans",
          "measure": "2 cans"
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Tomatoes",
          "measure": "2 cups "
        },
        {
          "ingredient": "Challots",
          "measure": "5"
        },
        {
          "ingredient": "Garlic",
          "measure": "2 cloves"
        },
        {
          "ingredient": "Parsley",
          "measure": "Pinch"
        },
        {
          "ingredient": "Chorizo",
          "measure": "1/2 kg chopped "
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "52804",
      "meal": "Poutine",
      "drinkAlternate": null,
      "category": "Miscellaneous",
      "area": "Canadian",
      "instructions": "Heat oil in a deep fryer or deep heavy skillet to 365°F (185°C).\r\nWarm gravy in saucepan or microwave.\r\nPlace the fries into the hot oil, and cook until light brown, about 5 minutes.\r\nRemove to a paper towel lined plate to drain.\r\nPlace the fries on a serving platter, and sprinkle the cheese over them.\r\nLadle gravy over the fries and cheese, and serve immediately.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/uuyrrx1487327597.jpg",
      "tags": "UnHealthy,Speciality,HangoverFood",
      "youtube": "https://www.youtube.com/watch?v=UVAMAoA2_WU",
      "source": "http://www.food.com/recipe/real-canadian-poutine-113388",
      "ingredients": [
        {
          "ingredient": "Vegetable Oil",
          "measure": "Dash"
        },
        {
          "ingredient": "Beef Gravy",
          "measure": "1 Can"
        },
        {
          "ingredient": "Potatoes",
          "measure": "5 thin cut"
        },
        {
          "ingredient": "Cheese Curds",
          "measure": "2 cups"
        }
      ],
      "categoryId": "5"
    },
    {
      "id": "52905",
      "meal": "Chocolate Souffle",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "French",
      "instructions": "Heat oven to 220C/fan 200C/gas 7 and place a baking tray on the top shelf. For the sauce, heat the cream and sugar until boiling. Remove from the heat, stir in the chocolate and butter until melted, then keep warm.\r\nBrush 6 x 150ml ramekins with melted butter, sprinkle with the 2 tbsp caster sugar, then tip out any excess. Melt the chocolate and cream in a bowl over a pan of simmering water, cool, then mix in the egg yolks. Whisk the egg whites until they hold their shape, then add the sugar, 1 tbsp at a time, whisking back to the same consistency. Mix a spoonful into the chocolate, then gently fold in the rest.\r\nWorking quickly, fill the ramekins, wipe the rims clean and run your thumb around the edges. Turn oven down to 200C/fan 180C/gas 6, place the ramekins onto the baking tray, then bake for 8-10 mins until risen with a slight wobble. Don’t open the oven door too early as this may make them collapse.\r\nOnce the soufflés are ready, dust with icing sugar, scoop a small hole from their tops, then pour in some of the hot chocolate sauce. Replace the lids and serve straight away.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/twspvx1511784937.jpg",
      "tags": "DinnerParty,Desert,Pudding,Chocolate",
      "youtube": "https://www.youtube.com/watch?v=FWqfkUEWOTg",
      "source": "https://www.bbcgoodfood.com/recipes/5816/hot-chocolate-souffls-with-chocolate-cream-sauce",
      "ingredients": [
        {
          "ingredient": "Single Cream",
          "measure": "142ml"
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "25g"
        },
        {
          "ingredient": "Dark Chocolate",
          "measure": "100g "
        },
        {
          "ingredient": "Butter",
          "measure": "25g"
        },
        {
          "ingredient": "Butter",
          "measure": "drizzle"
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "50g"
        },
        {
          "ingredient": "Dark Chocolate",
          "measure": "175g"
        },
        {
          "ingredient": "Double Cream",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Egg Yolks",
          "measure": "4"
        },
        {
          "ingredient": "Egg White",
          "measure": "5"
        },
        {
          "ingredient": "Double Cream",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Icing Sugar",
          "measure": "to serve"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52843",
      "meal": "Lamb Tagine",
      "drinkAlternate": null,
      "category": "Lamb",
      "area": "Moroccan",
      "instructions": "Heat the olive oil in a heavy-based pan and add the onion and carrot. Cook for 3- 4 mins until softened.\r\n\r\nAdd the diced lamb and brown all over. Stir in the garlic and all the spices and cook for a few mins more or until the aromas are released.\r\n\r\nAdd the honey and apricots, crumble in the stock cube and pour over roughly 500ml boiling water or enough to cover the meat. Give it a good stir and bring to the boil. Turn down to a simmer, put the lid on and cook for 1 hour.\r\n\r\nRemove the lid and cook for a further 30 mins, then stir in the squash. Cook for 20 – 30 mins more until the squash is soft and the lamb is tender. Serve alongside rice or couscous and sprinkle with parsley and pine nuts, if using.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/yuwtuu1511295751.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=bR5Cqu84S_k",
      "source": "https://www.bbcgoodfood.com/recipes/2303638/family-meals-easy-lamb-tagine-",
      "ingredients": [
        {
          "ingredient": "Olive Oil",
          "measure": "2 tblsp "
        },
        {
          "ingredient": "Onion",
          "measure": "1 finely sliced"
        },
        {
          "ingredient": "Carrots",
          "measure": "2 chopped"
        },
        {
          "ingredient": "Lamb Leg",
          "measure": "500g"
        },
        {
          "ingredient": "Garlic",
          "measure": "2 cloves minced"
        },
        {
          "ingredient": "Cumin",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Ginger",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Saffron",
          "measure": "¼ tsp"
        },
        {
          "ingredient": "Cinnamon",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Honey",
          "measure": "1 tblsp "
        },
        {
          "ingredient": "Apricot",
          "measure": "100g "
        },
        {
          "ingredient": "Vegetable Stock Cube",
          "measure": "1"
        },
        {
          "ingredient": "Butternut Squash",
          "measure": "1 medium chopped"
        },
        {
          "ingredient": "Couscous",
          "measure": "Steamed"
        },
        {
          "ingredient": "Parsley",
          "measure": "Chopped"
        }
      ],
      "categoryId": "4"
    },
    {
      "id": "53044",
      "meal": "Portuguese barbecued pork (Febras assadas)",
      "drinkAlternate": null,
      "category": "Pork",
      "area": "Portuguese",
      "instructions": "STEP 1\r\n\r\nCut the tenderloins into 5 equal-size pieces leaving the tail ends a little longer. Take a clear plastic bag and slip one of the pieces in. Bash it into an escalope the size of a side-plate with a rolling pin and repeat with the remaining pieces.\r\n\r\nSTEP 2\r\n\r\nPut the wine, paprika, some salt and pepper and the juice of ½ a lemon in a bowl and add the pork. Leave to marinate for 20-30 minutes, while you get your barbecue to the stage where the coals are glowing but there are no flames.\r\n\r\nSTEP 3\r\n\r\nTo make the chips, fill a basin with cool water and cut the potatoes into 3cm-thick chips. Soak them in the water for 5 minutes and then change the water. Leave for 5 more minutes. Drain and then pat dry on a towel or with kitchen paper.\r\n\r\nSTEP 4\r\n\r\nHeat the oil in a deep fryer or a deep heavy-based pan with a lid to 130C and lower the chips into the oil (in batches). Blanch for 8-10 minutes. Remove from the oil and drain well. Place on a tray to cool. Reheat the oil to 180C (make sure it’s hot or your chips will be soggy) and lower the basket of chips into the oil (again, do this in batches). Leave to cook for 2 minutes and then give them a little shake. Cook for another minute or so until they are well coloured and crisp to the touch. Drain well for a few minutes, tip into a bowl and sprinkle with sea salt.\r\n\r\nSTEP 5\r\n\r\nThe pork will cook quickly so do it in 2 batches. Take the pieces out of the marinade, rub them with oil, and drop them onto the barbecue (you could also use a chargrill). Cook for 1 minute on each side – they may flare up as you do so. This should really be enough time as they will keep on cooking. Take them off the barbecue and pile onto a plate. Repeat with the remaining batch.\r\n\r\nSTEP 6\r\n\r\nServe by piling a plate with chips, drop the pork on top of each pile and pouring the juices from the plate over so the chips take up the flavours. Top with a spoon of mayonnaise and a wedge of lemon.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/cybyue1614349443.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=tVpsZaejyYU",
      "source": "https://www.olivemagazine.com/recipes/meat-and-poultry/febras-assadas-portuguese-barbecued-pork-served-with-lemon-and-mayo-on-chips/",
      "ingredients": [
        {
          "ingredient": "Pork",
          "measure": "2"
        },
        {
          "ingredient": "White Wine",
          "measure": "200ml"
        },
        {
          "ingredient": "Paprika",
          "measure": "1/2 tsp"
        },
        {
          "ingredient": "Lemon",
          "measure": "2"
        },
        {
          "ingredient": "Lemon Juice",
          "measure": "1/2 "
        },
        {
          "ingredient": "Olive Oil",
          "measure": "Dash"
        },
        {
          "ingredient": "Mayonnaise",
          "measure": "To serve"
        },
        {
          "ingredient": "Potatoes",
          "measure": "1 kg"
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": "For frying"
        }
      ],
      "categoryId": "7"
    },
    {
      "id": "53056",
      "meal": "Croatian lamb peka",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "Croatian",
      "instructions": "Preheat oven to 200°C fan / 220°C / 425°F / Gas mark 7\r\nIf you have not bought diced lamb, cut your lamb shoulder or leg into large chunks and place to one side.\r\nChunks of chopped lamb of a red chopping board\r\nMake oil marinade -\r\nMix 80ml of olive oil in a bowl with garlic puree, sundried tomato puree ,black pepper and salt.\r\nolive oil, gia sundried tomato puree and gia garlic puree and black pepper mixed together in a silver bowl to make Croatian peka\r\nAdd potatoes and vegetables into a large lidded casserole dish.\r\nChopped up vegetables which consist of chopped up red onion, courgette, potatoes red peppers in a cast iron pan\r\nPlace diced lamb on top of the vegetables, pour the marinade and wine over the top.\r\nChunks of lamb covered in in a sundried tomato oil sauce which is on top of chopped red onion, aubergine, courgette and potatoes in a cast iron pan\r\nAdd the rosemary, thyme and sage, trying to keep the herbs on top.\r\nSo you can easily remove the herb stalks once cooked.\r\nChunks of lamb coated in a sundried tomato oil sauce and covered with thyme, rosemary and sage which is on top of chopped red onion, aubergine, courgette and potatoes in a cast iron pan\r\nPlace lid on the casserole dish and cook for 1hr 30 minute\r\nIf you do not have a lid cover very well with kitchen foil\r\nCast iron dish with lid on in the oven\r\nTake the lid off, remove any thick herb stems. Stir in 2 tbsp of olive oil.\r\nCook for a further 20-30 mins.\r\nCooked Croatian Lamb Peka in a cast iron pan in the oven\r\nServe with fresh homemade bread to dip into the juices.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/pn59o51628769837.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=K0ipnz4fwJI",
      "source": "https://flawlessfood.co.uk/croatian-lamb-peka/",
      "ingredients": [
        {
          "ingredient": "Potatoes",
          "measure": "600g"
        },
        {
          "ingredient": "Courgettes",
          "measure": "1 chopped"
        },
        {
          "ingredient": "Carrots",
          "measure": "1 chopped"
        },
        {
          "ingredient": "Green Pepper",
          "measure": "1 chopped"
        },
        {
          "ingredient": "Aubergine",
          "measure": "1 small"
        },
        {
          "ingredient": "Onion",
          "measure": "1 Large Chopped"
        },
        {
          "ingredient": "Lamb Shoulder",
          "measure": "800g"
        },
        {
          "ingredient": "Garlic Sauce",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Tomato Puree",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "80 ml "
        },
        {
          "ingredient": "Thyme",
          "measure": "Sprinking"
        },
        {
          "ingredient": "White Wine",
          "measure": "250ml"
        },
        {
          "ingredient": "Pepper",
          "measure": "Pinch"
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "53032",
      "meal": "Tonkatsu pork",
      "drinkAlternate": null,
      "category": "Pork",
      "area": "Japanese",
      "instructions": "STEP 1\r\nRemove the large piece of fat on the edge of each pork loin, then bash each of the loins between two pieces of baking parchment until around 1cm in thickness – you can do this using a meat tenderiser or a rolling pin. Once bashed, use your hands to reshape the meat to its original shape and thickness – this step will ensure the meat is as succulent as possible.\r\n\r\nSTEP 2\r\nPut the flour, eggs and panko breadcrumbs into three separate wide-rimmed bowls. Season the meat, then dip first in the flour, followed by the eggs, then the breadcrumbs.\r\n\r\nSTEP 3\r\nIn a large frying or sauté pan, add enough oil to come 2cm up the side of the pan. Heat the oil to 180C – if you don’t have a thermometer, drop a bit of panko into the oil and if it sinks a little then starts to fry, the oil is ready. Add two pork chops and cook for 1 min 30 secs on each side, then remove and leave to rest on a wire rack for 5 mins. Repeat with the remaining pork chops.\r\n\r\nSTEP 4\r\nWhile the pork is resting, make the sauce by whisking the ingredients together, adding a splash of water if it’s particularly thick. Slice the tonkatsu and serve drizzled with the sauce.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/lwsnkl1604181187.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=aASr5x0d3Ys",
      "source": "https://www.bbcgoodfood.com/recipes/tonkatsu-pork",
      "ingredients": [
        {
          "ingredient": "Pork Chops",
          "measure": "4"
        },
        {
          "ingredient": "Flour",
          "measure": "100g "
        },
        {
          "ingredient": "Eggs",
          "measure": "2 Beaten "
        },
        {
          "ingredient": "Breadcrumbs",
          "measure": "100g "
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": "Fry"
        },
        {
          "ingredient": "Tomato Ketchup",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Worcestershire Sauce",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Oyster Sauce",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "2 tblsp "
        }
      ],
      "categoryId": "7"
    },
    {
      "id": "52895",
      "meal": "English Breakfast",
      "drinkAlternate": null,
      "category": "Breakfast",
      "area": "British",
      "instructions": "Heat the flat grill plate over a low heat, on top of 2 rings/flames if it fits, and brush sparingly with light olive oil.\r\nCook the sausages first. Add the sausages to the hot grill plate/the coolest part if there is one and allow to cook slowly for about 15-20 minutes, turning occasionally, until golden. After the first 10 minutes, increase the heat to medium before beginning to cook the other ingredients. If you are struggling for space, completely cook the sausages and keep hot on a plate in the oven.\r\nSnip a few small cuts into the fatty edge of the bacon. Place the bacon straight on to the grill plate and fry for 2-4 minutes each side or until your preferred crispiness is reached. Like the sausages, the cooked bacon can be kept hot on a plate in the oven.\r\nFor the mushrooms, brush away any dirt using a pastry brush and trim the stalk level with the mushroom top. Season with salt and pepper and drizzle over a little olive oil. Place stalk-side up on the grill plate and cook for 1-2 minutes before turning and cooking for a further 3-4 minutes. Avoid moving the mushrooms too much while cooking, as this releases the natural juices, making them soggy.\r\nFor the tomatoes, cut the tomatoes across the centre/or in half lengthways if using plum tomatoes , and with a small, sharp knife remove the green 'eye'. Season with salt and pepper and drizzle with a little olive oil. Place cut-side down on the grill plate and cook without moving for 2 minutes. Gently turn over and season again. Cook for a further 2-3 minutes until tender but still holding their shape.\r\nFor the black pudding, cut the black pudding into 3-4 slices and remove the skin. Place on the grill plate and cook for 1½-2 minutes each side until slightly crispy.\r\nFor 'proper' fried bread it's best to cook it in a separate pan. Ideally, use bread that is a couple of days old. Heat a frying pan to a medium heat and cover the base with oil. Add the bread and cook for 2-3 minutes each side until crispy and golden. If the pan becomes too dry, add a little more oil. For a richer flavour, add a knob of butter after you turn the slice.\r\nFor the fried eggs, break the egg straight into the pan with the fried bread and leave for 30 seconds. Add a good knob of butter and lightly splash/baste the egg with the butter when melted. Cook to your preferred stage, season and gently remove with a fish slice.\r\nOnce all the ingredients are cooked, serve on warm plates and enjoy straight away with a good squeeze of tomato ketchup or brown sauce.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/utxryw1511721587.jpg",
      "tags": "Breakfast",
      "youtube": "https://www.youtube.com/watch?v=FXjYU2Ensck",
      "source": "https://www.bbc.co.uk/food/recipes/stressfreefullenglis_67721",
      "ingredients": [
        {
          "ingredient": "Sausages",
          "measure": "2"
        },
        {
          "ingredient": "Bacon",
          "measure": "3"
        },
        {
          "ingredient": "Mushrooms",
          "measure": "2"
        },
        {
          "ingredient": "Tomatoes",
          "measure": "2"
        },
        {
          "ingredient": "Black Pudding",
          "measure": "1 Slice"
        },
        {
          "ingredient": "Eggs",
          "measure": "2"
        },
        {
          "ingredient": "Bread",
          "measure": "1 Slice"
        }
      ],
      "categoryId": "13"
    },
    {
      "id": "52898",
      "meal": "Chelsea Buns",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "British",
      "instructions": "Sift the flour and salt into a large bowl. Make a well in the middle and add the yeast.\r\nMeanwhile, warm the milk and butter in a saucepan until the butter melts and the mixture is lukewarm.\r\nAdd the milk mixture and egg to the flour mixture and stir until the contents of the bowl come together as a soft dough. (You may need to add a little extra flour.)\r\nTip the dough onto a generously floured work surface. Knead for five minutes, adding more flour if necessary, until the dough is smooth and elastic and no longer feels sticky.\r\nLightly oil a bowl with a little of the vegetable oil. Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size.\r\nLightly grease a baking tray.\r\nFor the filling, knock the dough back to its original size and turn out onto a lightly floured work surface. Roll the dough out into a rectangle 0.5cm/¼in thick. Brush all over with the melted butter, then sprinkle over the brown sugar, cinnamon and dried fruit.\r\nRoll the dough up into a tight cylinder , cut ten 4cm/1½in slice and place them onto a lightly greased baking sheet, leaving a little space between each slice. Cover with a tea towel and set aside to rise for 30 minutes.\r\nPreheat oven to 190C/375F/Gas 5.\r\nBake the buns in the oven for 20-25 minutes, or until risen and golden-brown.\r\nMeanwhile, for the glaze, heat the milk and sugar in a saucepan until boiling. Reduce the heat and simmer for 2-3 minutes.\r\nRemove the buns from the oven and brush with the glaze, then set aside to cool on a wire rack.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/vqpwrv1511723001.jpg",
      "tags": "Bun,Baking,Treat",
      "youtube": "https://www.youtube.com/watch?v=i_zemP3yBKw",
      "source": "https://www.bbc.co.uk/food/recipes/chelsea_buns_95015",
      "ingredients": [
        {
          "ingredient": "White Flour",
          "measure": "500g"
        },
        {
          "ingredient": "Salt",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Yeast",
          "measure": "7g"
        },
        {
          "ingredient": "Milk",
          "measure": "300ml "
        },
        {
          "ingredient": "Butter",
          "measure": "40g"
        },
        {
          "ingredient": "Eggs",
          "measure": "1"
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": "Dash"
        },
        {
          "ingredient": "Butter",
          "measure": "25g"
        },
        {
          "ingredient": "Brown Sugar",
          "measure": "75g"
        },
        {
          "ingredient": "Cinnamon",
          "measure": "2 tsp"
        },
        {
          "ingredient": "Dried Fruit",
          "measure": "150g"
        },
        {
          "ingredient": "Milk",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "2 tbs"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52994",
      "meal": "Skillet Apple Pork Chops with Roasted Sweet Potatoes & Zucchini",
      "drinkAlternate": null,
      "category": "Pork",
      "area": "American",
      "instructions": "\r\nServes 2\r\n\r\n\r\n1. \r\n\r\nAdjust racks to top and middle positions and preheat oven to 450 degrees. Wash and dry all produce. Dice sweet potatoes into 1/2-inch pieces. Toss on a baking sheet with a drizzle of oil, salt, and pepper. Roast on top rack for 12 minutes (we'll roast the zucchini then). \r\n\r\n\r\n2. \r\n\r\nMeanwhile, halve and core apple; thinly slice into half-moons. Peel and finely chop garlic. Quarter lemon. Trim and halve zucchini lengthwise; cut crosswise into 1/2-inch-thick half-moons. Toss on a second baking sheet with a drizzle of oil and a pinch of salt and pepper. Set aside. \r\n\r\n\r\n3. \r\n\r\nPat pork dry with paper towels and season all over with salt and pepper. Heat a drizzle of oil in a large pan over medium-high heat. Add pork and cook until browned and cooked through, 4-5 minutes per side. Turn off heat; transfer to a plate. \r\n\r\n\r\n4. \r\n\r\nOnce sweet potatoes have roasted 12 minutes, transfer baking sheet with zucchini to middle rack and continue roasting until both veggies are browned and softened, 12-15 minutes more. \r\n\r\n\r\n5. \r\n\r\nMeanwhile, melt 1 TBSP butter (2 TBSP for 4 servings) in pan used for pork over medium-high heat. Add apple and season with salt and pepper. Cook, scraping up any browned bits from bottom of pan, until apple is slightly softened, 2-3 minutes. Add garlic; cook until fragrant, 30 seconds. Add 1/z cup water (3/4 cup for 4), stock concentrate, and 11/2 tsp sugar (3 tsp for 4). Cook, stirring, until sauce has thickened and apple is very tender, 3-5 minutes. Season with salt and pepper. \r\n\r\n\r\n6. \r\n\r\nRemove pan with apple from heat; stir in 1 TBSP butter (2 TBSP for 4 servings) and a squeeze of lemon juice. Divide pork, zucchini, and sweet potatoes between plates. Top pork with glazed apple sauce. Top zucchini with a squeeze of lemon juice. ",
      "mealThumb": "https://www.themealdb.com/images/media/meals/h3ijwo1581013377.jpg",
      "tags": null,
      "youtube": "",
      "source": "",
      "ingredients": [
        {
          "ingredient": "Potatoes",
          "measure": "2"
        },
        {
          "ingredient": "Apples",
          "measure": "1"
        },
        {
          "ingredient": "Garlic",
          "measure": "2 cloves"
        },
        {
          "ingredient": "Lemon",
          "measure": "1"
        },
        {
          "ingredient": "Pork",
          "measure": "2"
        },
        {
          "ingredient": "Zucchini",
          "measure": "1"
        },
        {
          "ingredient": "Chicken Stock",
          "measure": "1"
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": "1 tbsp"
        },
        {
          "ingredient": "Sugar",
          "measure": "1 1/2 tsp "
        },
        {
          "ingredient": "Butter",
          "measure": "2 tbsp"
        }
      ],
      "categoryId": "7"
    },
    {
      "id": "52785",
      "meal": "Dal fry",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "Indian",
      "instructions": "Wash and soak toor dal in approx. 3 cups of water, for at least one hours. Dal will be double in volume after soaking. Drain the water.\r\nCook dal with 2-1/2 cups water and add salt, turmeric, on medium high heat, until soft in texture (approximately 30 mins) it should be like thick soup.\r\nIn a frying pan, heat the ghee. Add cumin seeds, and mustard seeds. After the seeds crack, add bay leaves, green chili, ginger and chili powder. Stir for a few seconds.\r\nAdd tomatoes, salt and sugar stir and cook until tomatoes are tender and mushy.\r\nAdd cilantro and garam masala cook for about one minute.\r\nPour the seasoning over dal mix it well and cook for another minute.\r\nServe with Naan.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wuxrtu1483564410.jpg",
      "tags": "Curry,Vegetarian,Cake",
      "youtube": "https://www.youtube.com/watch?v=J4D855Q9-jg",
      "source": "https://www.instagram.com/p/BO21bpYD3Fu",
      "ingredients": [
        {
          "ingredient": "Toor dal",
          "measure": "1 cup"
        },
        {
          "ingredient": "Water",
          "measure": "2-1/2 cups"
        },
        {
          "ingredient": "Salt",
          "measure": "1 tsp"
        },
        {
          "ingredient": "Turmeric",
          "measure": "1/4 tsp"
        },
        {
          "ingredient": "Ghee",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Chopped tomatoes",
          "measure": "1 cup"
        },
        {
          "ingredient": "Cumin seeds",
          "measure": "1/2 tsp"
        },
        {
          "ingredient": "Mustard Seeds",
          "measure": "1/2 tsp"
        },
        {
          "ingredient": "Bay Leaf",
          "measure": "2"
        },
        {
          "ingredient": "Green Chilli",
          "measure": "1 tbs chopped"
        },
        {
          "ingredient": "Ginger",
          "measure": "2 tsp shredded"
        },
        {
          "ingredient": "Cilantro",
          "measure": "2 tbs "
        },
        {
          "ingredient": "Red Pepper",
          "measure": "1/2 tsp"
        },
        {
          "ingredient": "Salt",
          "measure": "1/2 tsp"
        },
        {
          "ingredient": "Sugar",
          "measure": "1 tsp"
        },
        {
          "ingredient": "Garam Masala",
          "measure": "1/4 tsp"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "52912",
      "meal": "Three-cheese souffles",
      "drinkAlternate": null,
      "category": "Miscellaneous",
      "area": "French",
      "instructions": "Heat oven to 200C/180C fan/ gas 6 and butter 4 small (about 200ml) ramekins. Sprinkle the Parmesan into the ramekins, turning until all sides are covered. Place the milk and bay leaves in a large saucepan over a gentle heat and bring to the boil. Turn off the heat and leave to infuse for 15 mins.\r\nDiscard the bay leaves, add the butter and flour, and return to a low heat. Very gently simmer, stirring continuously with a balloon whisk, for about 6 mins until you get a smooth, thick white sauce. Make sure that you get right into the corners of the pan to stop the sauce from catching or becoming lumpy.\r\nOnce thickened, transfer the sauce to a large bowl and stir in the mustard powder, cayenne pepper, Gruyère and egg yolks until fully combined.\r\nIn a spotlessly clean bowl and with a clean whisk, beat the egg whites just until peaks begin to form.\r\nCarefully fold the egg whites into the cheese sauce in three stages making sure you fold, rather than stir, to keep the egg whites light and airy. Fill the prepared ramekins with the soufflé mix.\r\nTop each soufflé with a slice of goat’s cheese, then place on a baking tray. Bake for 20-25 mins or until springy and well risen but cooked through.\r\nLeave to cool, then run a knife around the edge of each dish and remove the soufflés. If preparing in advance, place soufflés upside down (for neat presentation), on a tray. Cover tray in cling film. Chill for a few days or freeze for up to 1 month.\r\nWhen ready to re-bake, heat oven to 200C/180C fan/gas 6. Place the upside-down soufflés in a shallow baking dish, top with the remaining goat’s cheese slices and pour over the cream (this stops them from drying out when baked for the second time). Cook for 8-10 mins until golden. Serve immediately alongside some simply dressed salad.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/sxwquu1511793428.jpg",
      "tags": "Baking",
      "youtube": "https://www.youtube.com/watch?v=mS_gbQpBvZo",
      "source": "https://www.bbcgoodfood.com/recipes/3028701/threecheese-souffls",
      "ingredients": [
        {
          "ingredient": "Butter",
          "measure": "50g"
        },
        {
          "ingredient": "Parmesan",
          "measure": "25g"
        },
        {
          "ingredient": "Milk",
          "measure": "300ml "
        },
        {
          "ingredient": "Bay Leaves",
          "measure": "2"
        },
        {
          "ingredient": "Plain Flour",
          "measure": "5 tbs"
        },
        {
          "ingredient": "English Mustard",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Cayenne Pepper",
          "measure": "Pod of"
        },
        {
          "ingredient": "Gruyère",
          "measure": "140g"
        },
        {
          "ingredient": "Eggs",
          "measure": "3"
        },
        {
          "ingredient": "Goats Cheese",
          "measure": "8 slices"
        },
        {
          "ingredient": "Double Cream",
          "measure": "150ml"
        },
        {
          "ingredient": "Spinach",
          "measure": "to serve"
        }
      ],
      "categoryId": "5"
    },
    {
      "id": "53069",
      "meal": "Bistek",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "Filipino",
      "instructions": "0.\tMarinate beef in soy sauce, lemon (or calamansi), and ground black pepper for at least 1 hour. Note: marinate overnight for best result\r\n1.\tHeat the cooking oil in a pan then pan-fry half of the onions until the texture becomes soft. Set aside\r\n2.\tDrain the marinade from the beef. Set it aside. Pan-fry the beef on the same pan where the onions were fried for 1 minute per side. Remove from the pan. Set aside\r\n3.\tAdd more oil if needed. Saute garlic and remaining raw onions until onion softens.\r\n4.\tPour the remaining marinade and water. Bring to a boil.\r\n5.\tAdd beef. Cover the pan and simmer until the meat is tender. Note: Add water as needed.\r\n6.\tSeason with ground black pepper and salt as needed. Top with pan-fried onions.\r\n7.\tTransfer to a serving plate. Serve hot. Share and Enjoy!\r\n",
      "mealThumb": "https://www.themealdb.com/images/media/meals/4pqimk1683207418.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=xOQON5_S7as",
      "source": "https://panlasangpinoy.com/bistek-tagalog-beefsteak-recipe/",
      "ingredients": [
        {
          "ingredient": "Beef",
          "measure": "1 lb"
        },
        {
          "ingredient": "Soy Sauce",
          "measure": "5 tablespoons"
        },
        {
          "ingredient": "Lemon",
          "measure": "1"
        },
        {
          "ingredient": "Garlic",
          "measure": "3 cloves"
        },
        {
          "ingredient": "Onion",
          "measure": "3 parts "
        },
        {
          "ingredient": "Olive Oil",
          "measure": "4 tbs"
        },
        {
          "ingredient": "Water",
          "measure": "1 cup "
        },
        {
          "ingredient": "Salt",
          "measure": "1 pinch"
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "52878",
      "meal": "Beef and Oyster pie",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "British",
      "instructions": "Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry.\r\nIn the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.\r\nPreheat the oven to 180C/350F/Gas 4.\r\nPour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced.\r\nSkim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.\r\nIncrease the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.\r\nRoll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg.\r\nRoll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wrssvt1511556563.jpg",
      "tags": "Pie",
      "youtube": "https://www.youtube.com/watch?v=ONX74yP6JnI",
      "source": "https://www.bbc.co.uk/food/recipes/beef_and_oyster_pie_65230",
      "ingredients": [
        {
          "ingredient": "Beef",
          "measure": "900g"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Shallots",
          "measure": "3"
        },
        {
          "ingredient": "Garlic",
          "measure": "2 cloves minced"
        },
        {
          "ingredient": "Bacon",
          "measure": "125g"
        },
        {
          "ingredient": "Thyme",
          "measure": "1 tbs chopped"
        },
        {
          "ingredient": "Bay Leaf",
          "measure": "2"
        },
        {
          "ingredient": "Stout",
          "measure": "330ml"
        },
        {
          "ingredient": "Beef Stock",
          "measure": "400ml"
        },
        {
          "ingredient": "Corn Flour",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Oysters",
          "measure": "8"
        },
        {
          "ingredient": "Plain Flour",
          "measure": "400g"
        },
        {
          "ingredient": "Salt",
          "measure": "pinch"
        },
        {
          "ingredient": "Butter",
          "measure": "250g"
        },
        {
          "ingredient": "Eggs",
          "measure": "To Glaze"
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "52838",
      "meal": "Venetian Duck Ragu",
      "drinkAlternate": null,
      "category": "Pasta",
      "area": "Italian",
      "instructions": "Heat the oil in a large pan. Add the duck legs and brown on all sides for about 10 mins. Remove to a plate and set aside. Add the onions to the pan and cook for 5 mins until softened. Add the garlic and cook for a further 1 min, then stir in the cinnamon and flour and cook for a further min. Return the duck to the pan, add the wine, tomatoes, stock, herbs, sugar and seasoning. Bring to a simmer, then lower the heat, cover with a lid and cook for 2 hrs, stirring every now and then.\r\nCarefully lift the duck legs out of the sauce and place on a plate – they will be very tender so try not to lose any of the meat. Pull off and discard the fat, then shred the meat with 2 forks and discard the bones. Add the meat back to the sauce with the milk and simmer, uncovered, for a further 10-15 mins while you cook the pasta.\r\nCook the pasta following pack instructions, then drain, reserving a cup of the pasta water, and add the pasta to the ragu. Stir to coat all the pasta in the sauce and cook for 1 min more, adding a splash of cooking liquid if it looks dry. Serve with grated Parmesan, if you like.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/qvrwpt1511181864.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=oWQDVgjB_Lw",
      "source": "https://www.bbcgoodfood.com/recipes/venetian-duck-ragu",
      "ingredients": [
        {
          "ingredient": "Olive Oil",
          "measure": "1 tbls"
        },
        {
          "ingredient": "Duck Legs",
          "measure": "4"
        },
        {
          "ingredient": "Onions",
          "measure": "2 finely chopped"
        },
        {
          "ingredient": "Garlic",
          "measure": "2 cloves minced"
        },
        {
          "ingredient": "Cinnamon",
          "measure": "2 tsp ground"
        },
        {
          "ingredient": "Plain Flour",
          "measure": "2 tsp"
        },
        {
          "ingredient": "Red Wine",
          "measure": "250ml"
        },
        {
          "ingredient": "Chopped Tomatoes",
          "measure": "800g"
        },
        {
          "ingredient": "Chicken Stock Cube",
          "measure": "1"
        },
        {
          "ingredient": "Rosemary",
          "measure": "3 sprigs"
        },
        {
          "ingredient": "Bay Leaves",
          "measure": "2"
        },
        {
          "ingredient": "Sugar",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Milk",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Paccheri Pasta",
          "measure": "600g"
        },
        {
          "ingredient": "Parmesan Cheese",
          "measure": "Grated"
        }
      ],
      "categoryId": "6"
    },
    {
      "id": "52880",
      "meal": "McSinghs Scotch pie",
      "drinkAlternate": null,
      "category": "Lamb",
      "area": "British",
      "instructions": "Heat a large frying pan and toast the cumin seeds for a few minutes, then set aside. Heat the oil in the same pan and fry the onion, garlic, chilli, pepper and a good pinch of salt for around eight minutes, until there is no moisture left. Remove from the heat, stir in the toasted cumin seeds, ground mace (or nutmeg) and ground coriander. Leave to cool.\r\nIn a large bowl mix together the minced lamb, white pepper, fresh coriander, and the cooled spiced onion mixture until combined. Set aside, covered, in the fridge.\r\nPreheat the oven to 200C/400F/Gas 6 and generously grease a 20cm/8in diameter loose-bottomed or springform round cake tin with lard.\r\nTo make the pastry, sift the flour and salt in a large bowl and make a well in the centre.\r\nPut the milk, lard and 90ml/3fl oz of water in a saucepan and heat gently. When the lard has melted, increase the heat and bring to the boil.\r\nPour the boiling liquid into the flour, and use a wooden spoon to combine until cool enough to handle. Bring together into a ball.\r\nDust a work surface with flour and, working quickly, knead the dough briefly – it will be soft and moist. Set aside a third of the pastry and roll the rest out on a well-floured surface. Line the pie dish with the pastry, pressing it right up the sides until it pokes just over the top of the tin.\r\nAdd the filling into the pastry-lined tin bit by bit. As you reach the top, form a slight peak. Roll out the reserved pastry and top the pie with it. Pinch the edges to seal and trim the excess. Poke a hole in the top of the pie and insert a small tube made from aluminium foil to allow steam to escape.\r\nBrush the top of the pie with a little beaten egg yolk, and bake in the preheated oven for 30 minutes (put a tray on the shelf below to catch any drips). Then reduce the temperature to 160C/325F/Gas 3 and cook for a further 1¼ hours until golden-brown. Leave to cool completely before refrigerating for two hours, or overnight.\r\nRun a knife around the edge of the pie, remove from the tin and serve with chutneys, salads or pickles.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/vssrtx1511557680.jpg",
      "tags": "Pie",
      "youtube": "https://www.youtube.com/watch?v=1nArqhRyszw",
      "source": "https://www.bbc.co.uk/food/recipes/mcsinghs_scotch_pie_98356",
      "ingredients": [
        {
          "ingredient": "Cumin",
          "measure": "2 tsp"
        },
        {
          "ingredient": "Rapeseed Oil",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Red Onions",
          "measure": "2 finely chopped"
        },
        {
          "ingredient": "Garlic Clove",
          "measure": "6"
        },
        {
          "ingredient": "Green Chilli",
          "measure": "3 finely chopped"
        },
        {
          "ingredient": "Red Pepper",
          "measure": "1 finely chopped "
        },
        {
          "ingredient": "Nutmeg",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Coriander",
          "measure": "2 tsp"
        },
        {
          "ingredient": "Lamb Mince",
          "measure": "1kg"
        },
        {
          "ingredient": "Pepper",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Coriander",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Plain Flour",
          "measure": "340g"
        },
        {
          "ingredient": "Salt",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Milk",
          "measure": "90 ml "
        },
        {
          "ingredient": "Lard",
          "measure": "150g"
        },
        {
          "ingredient": "Egg Yolks",
          "measure": "Beaten"
        }
      ],
      "categoryId": "4"
    },
    {
      "id": "53077",
      "meal": "Cabbage Soup (Shchi)",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "Russian",
      "instructions": "Add the butter to a large Dutch oven or other heavy-duty pot over medium heat. When the butter has melted, add the onion and sauté until translucent.\r\nAdd the cabbage, carrot, and celery. Sauté until the vegetables begin to soften, stirring frequently, about 3 minutes.\r\nAdd the bay leaf and vegetable stock and bring to a boil over high heat. Reduce the heat to low and simmer, covered, until the vegetables are crisp-tender, about 15 minutes.\r\nAdd the potatoes and bring it back to a boil over high heat. Reduce the heat to low and simmer, covered, until the potatoes are tender, about 10 minutes.\r\nAdd the tomatoes (or undrained canned tomatoes) and bring the soup back to a boil over high heat. Reduce the heat to low and simmer, uncovered, for 5 minutes. Season to taste with salt and pepper.\r\nemove and discard the bay leaf from the pot.\r\nServe topped with fresh sour cream and fresh dill.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/60oc3k1699009846.jpg",
      "tags": "Soup",
      "youtube": "https://www.youtube.com/watch?v=lTjlbqGc_Y8",
      "source": "https://www.thespruceeats.com/traditional-russian-cabbage-soup-shchi-recipe-1135534",
      "ingredients": [
        {
          "ingredient": "Unsalted Butter",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Onion",
          "measure": "1 large"
        },
        {
          "ingredient": "Cabbage",
          "measure": "1 medium"
        },
        {
          "ingredient": "Carrots",
          "measure": "1"
        },
        {
          "ingredient": "Celery",
          "measure": "1"
        },
        {
          "ingredient": "Bay Leaf",
          "measure": "1"
        },
        {
          "ingredient": "Vegetable Stock",
          "measure": "8 cups "
        },
        {
          "ingredient": "Potatoes",
          "measure": "2 large"
        },
        {
          "ingredient": "Tomatoes",
          "measure": "2 large"
        },
        {
          "ingredient": "Sour Cream",
          "measure": "Garnish"
        },
        {
          "ingredient": "Dill",
          "measure": "Garnish"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "52783",
      "meal": "Rigatoni with fennel sausage sauce",
      "drinkAlternate": null,
      "category": "Lamb",
      "area": "Italian",
      "instructions": "Heat a tablespoon of oil in a large saute pan for which you have a lid. Add the sausage pieces and fry on a medium-high heat for 10 minutes, stirring regularly, until golden-brown all over. Transfer the sausages to a plate, then add the onion and fennel to the hot pan and fry for 15 minutes, stirring once in a while, until soft and caramelised; if the pan goes a bit dry, add a teaspoon or so of extra oil. Stir in the paprika, garlic and half the fennel seeds, fry for two minutes more, then pour on the wine and boil for 30 seconds, to reduce by half. Add the tomatoes, sugar, 100ml water, the seared sausage and half a teaspoon of salt, cover and simmer for 30 minutes; remove the lid after 10 minutes, and cook until the sauce is thick and rich. Remove from the heat, stir through the olives and remaining fennel seeds and set aside until you’re ready to serve.\r\n\r\nBring a large pot of salted water to a boil, add the pasta and cook for 12-14 minutes (or according to the instructions on the packet), until al dente. Meanwhile, reheat the sauce. Drain the pasta, return it to the pot, stir in a tablespoon of oil, then divide between the bowls. \r\n\r\nPut all the pesto ingredients except the basil in the small bowl of a food processor. Add a tablespoon of water and blitz to a rough paste. Add the basil, then blitz until just combined (the pesto has a much better texture if the basil is not overblended).\r\n\r\nSpoon over the ragù and top with a spoonful of pesto. Finish with a sprinkling of chopped fennel fronds, if you have any, and serve at once.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/qtqvys1468573168.jpg",
      "tags": "Pasta",
      "youtube": "https://www.youtube.com/watch?v=45dpOfESxr8",
      "source": "http://www.ottolenghi.co.uk/recipes/meat/rigatoni-with-fennel-sausage-sauce-and-pecorino-and-anchovy-pesto-shop",
      "ingredients": [
        {
          "ingredient": "olive oil",
          "measure": "2½ tbsp"
        },
        {
          "ingredient": "Italian fennel sausages",
          "measure": "6 cut into 1.5cm-thick slices"
        },
        {
          "ingredient": "onion",
          "measure": "1 large peeled and chopped"
        },
        {
          "ingredient": "fennel bulb",
          "measure": "1 trimmed and roughly chopped; reserve any fronds to garnish"
        },
        {
          "ingredient": "smoky paprika",
          "measure": "½ tsp"
        },
        {
          "ingredient": "garlic",
          "measure": "1 clove, peeled and sliced"
        },
        {
          "ingredient": "fennel seeds",
          "measure": "2 tsp lightly toasted and then gently crushed"
        },
        {
          "ingredient": "red wine",
          "measure": "100ml"
        },
        {
          "ingredient": "chopped tomatoes",
          "measure": "400g tinned"
        },
        {
          "ingredient": "caster sugar",
          "measure": "½ tsp"
        },
        {
          "ingredient": "pitted black olives",
          "measure": "50g cut in half lengthways"
        },
        {
          "ingredient": "rigatoni",
          "measure": "500g"
        },
        {
          "ingredient": "pecorino",
          "measure": "30g roughly crumbled into 0.5cm pieces"
        },
        {
          "ingredient": "anchovy fillet",
          "measure": "1  rinsed and patted dry"
        },
        {
          "ingredient": "garlic",
          "measure": "1 clove, peeled and crushed"
        },
        {
          "ingredient": "olive oil",
          "measure": "60ml"
        },
        {
          "ingredient": "basil leaves",
          "measure": "50g torn"
        }
      ],
      "categoryId": "4"
    },
    {
      "id": "52917",
      "meal": "White chocolate creme brulee",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "French",
      "instructions": "Heat the cream, chocolate and vanilla pod in a pan until the chocolate has melted. Take off the heat and allow to infuse for 10 mins, scraping the pod seeds into the cream. If using the vanilla extract, add straight away. Heat oven to 160C/fan 140C/gas 3.\r\nBeat yolks and sugar until pale. stir in the chocolate cream. Strain into a jug and pour into ramekins. Place in a deep roasting tray and pour boiling water halfway up the sides. Bake for 15-20 mins until just set with a wobbly centre. Chill in the fridge for at least 4 hrs.\r\nTo serve, sprinkle some sugar on top of the brûlées and caramelise with a blowtorch or briefly under a hot grill. Leave caramel to harden, then serve.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/uryqru1511798039.jpg",
      "tags": "Desert,DinnerParty,Pudding",
      "youtube": "https://www.youtube.com/watch?v=LmJ0lsPLHDc",
      "source": "https://www.bbcgoodfood.com/recipes/2540/white-chocolate-crme-brle",
      "ingredients": [
        {
          "ingredient": "Double Cream",
          "measure": "568ml"
        },
        {
          "ingredient": "White Chocolate Chips",
          "measure": "100g "
        },
        {
          "ingredient": "Vanilla",
          "measure": "Pod of"
        },
        {
          "ingredient": "Egg Yolks",
          "measure": "6"
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "Top"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52920",
      "meal": "Chicken Marengo",
      "drinkAlternate": null,
      "category": "Chicken",
      "area": "French",
      "instructions": "Heat the oil in a large flameproof casserole dish and stir-fry the mushrooms until they start to soften. Add the chicken legs and cook briefly on each side to colour them a little.\r\nPour in the passata, crumble in the stock cube and stir in the olives. Season with black pepper – you shouldn’t need salt. Cover and simmer for 40 mins until the chicken is tender. Sprinkle with parsley and serve with pasta and a salad, or mash and green veg, if you like.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/qpxvuq1511798906.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=U33HYUr-0Fw",
      "source": "https://www.bbcgoodfood.com/recipes/3146682/chicken-marengo",
      "ingredients": [
        {
          "ingredient": "Olive Oil",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Mushrooms",
          "measure": "300g"
        },
        {
          "ingredient": "Chicken Legs",
          "measure": "4"
        },
        {
          "ingredient": "Passata",
          "measure": "500g"
        },
        {
          "ingredient": "Chicken Stock Cube",
          "measure": "1"
        },
        {
          "ingredient": "Black Olives",
          "measure": "100g "
        },
        {
          "ingredient": "Parsley",
          "measure": "Chopped"
        }
      ],
      "categoryId": "2"
    },
    {
      "id": "52886",
      "meal": "Spotted Dick",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "British",
      "instructions": "Put the flour and salt in a bowl. Add the suet, currants, sugar, lemon and orange zest.\r\nPour in 150ml milk and mix to a firm but moist dough, adding the extra milk if necessary.\r\nShape into a fat roll about 20cm long. Place on a large rectangle of baking parchment. Wrap loosely to allow for the pudding to rise and tie the ends with string like a Christmas cracker.\r\nPlace a steamer over a large pan of boiling water, add the pudding to the steamer, cover and steam for 1 1/2 hours. Top up the pan with water from time to time.\r\nRemove from the steamer and allow to cool slightly before unwrapping. Serve sliced with custard.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/xqvyqr1511638875.jpg",
      "tags": "Fruity,Pudding,Desert",
      "youtube": "https://www.youtube.com/watch?v=fu15XOF-ros",
      "source": "https://www.bbcgoodfood.com/recipes/2686661/spotted-dick",
      "ingredients": [
        {
          "ingredient": "Self-raising Flour",
          "measure": "250g"
        },
        {
          "ingredient": "Salt",
          "measure": "pinch"
        },
        {
          "ingredient": "Suet",
          "measure": "125g"
        },
        {
          "ingredient": "Currants",
          "measure": "175g"
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "80g"
        },
        {
          "ingredient": "Lemon",
          "measure": "Zest of 1"
        },
        {
          "ingredient": "Orange",
          "measure": "Zest of 1"
        },
        {
          "ingredient": "Milk",
          "measure": "150ml"
        },
        {
          "ingredient": "Custard",
          "measure": "to serve"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52772",
      "meal": "Teriyaki Chicken Casserole",
      "drinkAlternate": null,
      "category": "Chicken",
      "area": "Japanese",
      "instructions": "Preheat oven to 350° F. Spray a 9x13-inch baking pan with non-stick spray.\r\nCombine soy sauce, ½ cup water, brown sugar, ginger and garlic in a small saucepan and cover. Bring to a boil over medium heat. Remove lid and cook for one minute once boiling.\r\nMeanwhile, stir together the corn starch and 2 tablespoons of water in a separate dish until smooth. Once sauce is boiling, add mixture to the saucepan and stir to combine. Cook until the sauce starts to thicken then remove from heat.\r\nPlace the chicken breasts in the prepared pan. Pour one cup of the sauce over top of chicken. Place chicken in oven and bake 35 minutes or until cooked through. Remove from oven and shred chicken in the dish using two forks.\r\n*Meanwhile, steam or cook the vegetables according to package directions.\r\nAdd the cooked vegetables and rice to the casserole dish with the chicken. Add most of the remaining sauce, reserving a bit to drizzle over the top when serving. Gently toss everything together in the casserole dish until combined. Return to oven and cook 15 minutes. Remove from oven and let stand 5 minutes before serving. Drizzle each serving with remaining sauce. Enjoy!",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wvpsxx1468256321.jpg",
      "tags": "Meat,Casserole",
      "youtube": "https://www.youtube.com/watch?v=4aZr5hZXP_s",
      "source": null,
      "ingredients": [
        {
          "ingredient": "soy sauce",
          "measure": "3/4 cup"
        },
        {
          "ingredient": "water",
          "measure": "1/2 cup"
        },
        {
          "ingredient": "brown sugar",
          "measure": "1/4 cup"
        },
        {
          "ingredient": "ground ginger",
          "measure": "1/2 teaspoon"
        },
        {
          "ingredient": "minced garlic",
          "measure": "1/2 teaspoon"
        },
        {
          "ingredient": "cornstarch",
          "measure": "4 Tablespoons"
        },
        {
          "ingredient": "chicken breasts",
          "measure": "2"
        },
        {
          "ingredient": "stir-fry vegetables",
          "measure": "1 (12 oz.)"
        },
        {
          "ingredient": "brown rice",
          "measure": "3 cups"
        }
      ],
      "categoryId": "2"
    },
    {
      "id": "52981",
      "meal": "Snert (Dutch Split Pea Soup)",
      "drinkAlternate": null,
      "category": "Side",
      "area": "Dutch",
      "instructions": "Gather the ingredients.\r\n\r\nIn a large soup pot, bring water, split peas, pork belly or bacon, pork chop, and bouillon cube to a boil. Reduce the heat to a simmer, cover and let cook for 45 minutes, stirring occasionally and skimming off any foam that rises to the top. \r\n\r\nRemove the pork chop, debone, and thinly slice the meat. Set aside.\r\n\r\nAdd the celery, carrots, potato, onion, leek, and celeriac to the soup. Return to the boil, reduce the heat to a simmer and let cook, uncovered, for another 30 minutes, adding a little extra water if the ingredients start to stick to the bottom of the pot.\r\n\r\nAdd the smoked sausage for the last 15 minutes of cooking time. When the vegetables are tender, remove the bacon and smoked sausage, slice thinly and set aside.\r\n\r\nIf you prefer a smooth consistency, purée the soup with a stick blender. Season to taste with salt and pepper. Add the meat back to the soup, setting some slices of rookworst aside.\r\n\r\nServe in heated bowls or soup plates, garnished with slices of rookworst and chopped celery leaf.\r\n\r\nEnjoy!",
      "mealThumb": "https://www.themealdb.com/images/media/meals/9ptx0a1565090843.jpg",
      "tags": "Soup,Cake",
      "youtube": "https://www.youtube.com/watch?v=5YV0sJLtLt8",
      "source": "https://www.thespruceeats.com/traditional-dutch-split-pea-soup-1129011",
      "ingredients": [
        {
          "ingredient": "Water",
          "measure": "2L"
        },
        {
          "ingredient": "Peas",
          "measure": "300g"
        },
        {
          "ingredient": "Pork",
          "measure": "100g "
        },
        {
          "ingredient": "Vegetable Stock Cube",
          "measure": "1"
        },
        {
          "ingredient": "Celery",
          "measure": "2"
        },
        {
          "ingredient": "Carrots",
          "measure": "2"
        },
        {
          "ingredient": "Potatoes",
          "measure": "1 large"
        },
        {
          "ingredient": "Onion",
          "measure": "1 small"
        },
        {
          "ingredient": "Leek",
          "measure": "1 small"
        },
        {
          "ingredient": "Celeriac",
          "measure": "1 cup "
        },
        {
          "ingredient": "Sausages",
          "measure": "1 pound"
        }
      ],
      "categoryId": "9"
    },
    {
      "id": "52795",
      "meal": "Chicken Handi",
      "drinkAlternate": null,
      "category": "Chicken",
      "area": "Indian",
      "instructions": "Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r\nTo the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r\nThen return the fried onion to the pot and stir. Add ginger paste and sauté well.\r\nNow add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r\nNext goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r\nAdd the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r\nWhen the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r\nFinally add the cream and give a final mix to combine everything well.\r\nSprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=IO0issT0Rmc",
      "source": "",
      "ingredients": [
        {
          "ingredient": "Chicken",
          "measure": "1.2 kg"
        },
        {
          "ingredient": "Onion",
          "measure": "5 thinly sliced"
        },
        {
          "ingredient": "Tomatoes",
          "measure": "2 finely chopped"
        },
        {
          "ingredient": "Garlic",
          "measure": "8 cloves chopped"
        },
        {
          "ingredient": "Ginger paste",
          "measure": "1 tbsp"
        },
        {
          "ingredient": "Vegetable oil",
          "measure": "¼ cup"
        },
        {
          "ingredient": "Cumin seeds",
          "measure": "2 tsp"
        },
        {
          "ingredient": "Coriander seeds",
          "measure": "3 tsp"
        },
        {
          "ingredient": "Turmeric powder",
          "measure": "1 tsp"
        },
        {
          "ingredient": "Chilli powder",
          "measure": "1 tsp"
        },
        {
          "ingredient": "Green chilli",
          "measure": "2"
        },
        {
          "ingredient": "Yogurt",
          "measure": "1 cup"
        },
        {
          "ingredient": "Cream",
          "measure": "¾ cup"
        },
        {
          "ingredient": "fenugreek",
          "measure": "3 tsp Dried"
        },
        {
          "ingredient": "Garam masala",
          "measure": "1 tsp"
        },
        {
          "ingredient": "Salt",
          "measure": "To taste"
        }
      ],
      "categoryId": "2"
    },
    {
      "id": "53021",
      "meal": "Golabki (cabbage roll)",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "Polish",
      "instructions": "Bring a large pot of lightly salted water to a boil. Place cabbage head into water, cover pot, and cook until cabbage leaves are slightly softened enough to remove from head, 3 minutes. Remove cabbage from pot and let cabbage sit until leaves are cool enough to handle, about 10 minutes.\r\n\r\nRemove 18 whole leaves from the cabbage head, cutting out any thick tough center ribs. Set whole leaves aside. Chop the remainder of the cabbage head and spread it in the bottom of a casserole dish.\r\n\r\nMelt butter in a large skillet over medium-high heat. Cook and stir onion in hot butter until tender, 5 to 10 minutes. Cool.\r\n\r\nStir onion, beef, pork, rice, garlic, 1 teaspoon salt, and 1/4 teaspoon pepper together in a large bowl.\r\n\r\nPreheat oven to 350 degrees F (175 degrees C).\r\n\r\nPlace about 1/2 cup beef mixture on a cabbage leaf. Roll cabbage around beef mixture, tucking in sides to create an envelope around the meat. Repeat with remaining leaves and meat mixture. Place cabbage rolls in a layer atop the chopped cabbage in the casserole dish; season rolls with salt and black pepper.\r\n\r\nWhisk tomato soup, tomato juice, and ketchup together in a bowl. Pour tomato soup mixture over cabbage rolls and cover dish wish aluminum foil.\r\n\r\nBake in the preheated oven until cabbage is tender and meat is cooked through, about 1 hour.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/q8sp3j1593349686.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=rBrTkDdoPYg",
      "source": "https://www.allrecipes.com/recipe/234975/golabki-stuffed-cabbage-rolls/",
      "ingredients": [
        {
          "ingredient": "Cabbage",
          "measure": "1"
        },
        {
          "ingredient": "Butter",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Onion",
          "measure": "1 chopped"
        },
        {
          "ingredient": "Ground Beef",
          "measure": "1 lb"
        },
        {
          "ingredient": "Ground Pork",
          "measure": "1/2 lb"
        },
        {
          "ingredient": "Rice",
          "measure": "1 1/2 cups "
        },
        {
          "ingredient": "Garlic",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Salt",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Black Pepper",
          "measure": "1/4 tsp"
        },
        {
          "ingredient": "Tomato Puree",
          "measure": "3 cans"
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "52787",
      "meal": "Hot Chocolate Fudge",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "American",
      "instructions": "Line an 8-inch-square baking pan with wax paper or foil, and coat with non-stick spray.\r\nIn a microwave-safe bowl, combine the dark chocolate chips, heavy cream and half of the sweetened condensed milk. Microwave the dark chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nAdd the vanilla extract to the dark chocolate mixture and stir well until smooth.\r\nTransfer the dark chocolate mixture into the prepared pan and spread into an even layer.\r\nIn a separate bowl, combine the white chocolate chips with the remaining half of the sweetened condensed milk. Microwave the white chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nEvenly spread the white chocolate mixture on top of dark chocolate layer.\r\nTop the chocolate layers with the Mallow Bits or miniature marshmallows, and gently press them down.\r\nRefrigerate for 4 hours, or until set.\r\nRemove the fudge and wax paper from the pan. Carefully peel all of the wax paper from the fudge.\r\nCut the fudge into bite-sized pieces and serve.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/xrysxr1483568462.jpg",
      "tags": "Snack,Chocolate",
      "youtube": "https://www.youtube.com/watch?v=oJvbsVSblfk",
      "source": "",
      "ingredients": [
        {
          "ingredient": "Chocolate Chips",
          "measure": "2 cups"
        },
        {
          "ingredient": "Heavy Cream",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Condensed Milk",
          "measure": "1 – 14-ounce can"
        },
        {
          "ingredient": "Vanilla Extract",
          "measure": "1 tsp"
        },
        {
          "ingredient": "White Chocolate Chips",
          "measure": "1-⅓ cups"
        },
        {
          "ingredient": "Miniature Marshmallows",
          "measure": "1-½ cups"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52882",
      "meal": "Three Fish Pie",
      "drinkAlternate": null,
      "category": "Seafood",
      "area": "British",
      "instructions": "Preheat the oven to 200C/400F/Gas 6 (180C fan).\r\nPut the potatoes into a saucepan of cold salted water. Bring up to the boil and simmer until completely tender. Drain well and then mash with the butter and milk. Add pepper and taste to check the seasoning. Add salt and more pepper if necessary.\r\nFor the fish filling, melt the butter in a saucepan, add the leeks and stir over the heat. Cover with a lid and simmer gently for 10 minutes, or until soft. Measure the flour into a small bowl. Add the wine and whisk together until smooth.\r\nAdd the milk to the leeks, bring to the boil and then add the wine mixture. Stir briskly until thickened. Season and add the parsley and fish. Stir over the heat for two minutes, then spoon into an ovenproof casserole. Scatter over the eggs. Allow to cool until firm.\r\nSpoon the mashed potatoes over the fish mixture and mark with a fork. Sprinkle with cheese.\r\nBake for 30-40 minutes, or until lightly golden-brown on top and bubbling around the edges.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/spswqs1511558697.jpg",
      "tags": "Fish,Seafood,Dairy,Pie",
      "youtube": "https://www.youtube.com/watch?v=Ds1Jb8H5Sg8",
      "source": "https://www.bbc.co.uk/food/recipes/three_fish_pie_58875",
      "ingredients": [
        {
          "ingredient": "Potatoes",
          "measure": "1kg"
        },
        {
          "ingredient": "Butter",
          "measure": "Knob"
        },
        {
          "ingredient": "Milk",
          "measure": "Dash"
        },
        {
          "ingredient": "Gruyere",
          "measure": "50g"
        },
        {
          "ingredient": "Butter",
          "measure": "75g"
        },
        {
          "ingredient": "Leek",
          "measure": "2 sliced"
        },
        {
          "ingredient": "Plain Flour",
          "measure": "75g"
        },
        {
          "ingredient": "White Wine",
          "measure": "150ml"
        },
        {
          "ingredient": "Milk",
          "measure": "568ml"
        },
        {
          "ingredient": "Parsley",
          "measure": "2 tbs chopped"
        },
        {
          "ingredient": "Salmon",
          "measure": "250g"
        },
        {
          "ingredient": "Haddock",
          "measure": "250g"
        },
        {
          "ingredient": "Smoked Haddock",
          "measure": "250g"
        },
        {
          "ingredient": "Eggs",
          "measure": "6"
        }
      ],
      "categoryId": "8"
    },
    {
      "id": "52997",
      "meal": "Beef Banh Mi Bowls with Sriracha Mayo, Carrot & Pickled Cucumber",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "Vietnamese",
      "instructions": "Add'l ingredients: mayonnaise, siracha\r\n\r\n1\r\n\r\nPlace rice in a fine-mesh sieve and rinse until water runs clear. Add to a small pot with 1 cup water (2 cups for 4 servings) and a pinch of salt. Bring to a boil, then cover and reduce heat to low. Cook until rice is tender, 15 minutes. Keep covered off heat for at least 10 minutes or until ready to serve.\r\n\r\n2\r\n\r\nMeanwhile, wash and dry all produce. Peel and finely chop garlic. Zest and quarter lime (for 4 servings, zest 1 lime and quarter both). Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Halve, peel, and medium dice onion. Trim, peel, and grate carrot.\r\n\r\n3\r\n\r\nIn a medium bowl, combine cucumber, juice from half the lime, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. In a small bowl, combine mayonnaise, a pinch of garlic, a squeeze of lime juice, and as much sriracha as you’d like. Season with salt and pepper.\r\n\r\n4\r\n\r\nHeat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring, until softened, 4-5 minutes. Add beef, remaining garlic, and 2 tsp sugar (4 tsp for 4 servings). Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Stir in soy sauce. Turn off heat; taste and season with salt and pepper.\r\n\r\n5\r\n\r\nFluff rice with a fork; stir in lime zest and 1 TBSP butter. Divide rice between bowls. Arrange beef, grated carrot, and pickled cucumber on top. Top with a squeeze of lime juice. Drizzle with sriracha mayo.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/z0ageb1583189517.jpg",
      "tags": null,
      "youtube": "",
      "source": "",
      "ingredients": [
        {
          "ingredient": "Rice",
          "measure": "White"
        },
        {
          "ingredient": "Onion",
          "measure": "1"
        },
        {
          "ingredient": "Lime",
          "measure": "1"
        },
        {
          "ingredient": "Garlic Clove",
          "measure": "3"
        },
        {
          "ingredient": "Cucumber",
          "measure": "1"
        },
        {
          "ingredient": "Carrots",
          "measure": "3 oz "
        },
        {
          "ingredient": "Ground Beef",
          "measure": "1 lb"
        },
        {
          "ingredient": "Soy Sauce",
          "measure": "2 oz "
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "52992",
      "meal": "Soy-Glazed Meatloaves with Wasabi Mashed Potatoes & Roasted Carrots",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "American",
      "instructions": "1. Preheat oven to 425 degrees. Wash and dry all produce. Dice potatoes into 1/2-inch pieces. Trim, peel, and cut carrots on a diagonal into 1/2-inch-thick pieces. Trim and thinly slice scallions, separating whites from greens; finely chop whites. Peel and finely chop garlic.\r\n\r\n2. In a medium bowl, soak bread with 2 TBSP water (4 TBSP for 4 servings); break up with your hands until pasty. Stir in beef, sriracha, scallion whites, half the garlic, salt (we used 3/4 tsp kosher salt; 11/2 tsp for 4), and pepper. Form into two 1-inch-tall loaves (four loaves for 4). Place on one side of a baking sheet. Toss carrots on empty side of same sheet with a drizzle of oil, salt, and pepper. (For 4, spread meatloaves out across whole sheet and add carrots to a second sheet.) Bake for 20 minutes (we'll glaze the meatloaves then).\r\n\r\n3. Meanwhile, place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until very\r\ntender, 12-15 minutes. Reserve 1/2 cup potato cooking liquid, then drain. While potatoes cook, in a small bowl, combine soy sauce, garlic powder, 1/4 cup ketchup (1/2 cup for 4 servings), and 2 tsp sugar (4 tsp for 4).\r\n\r\n4. Once meatloaves and carrots have baked 20 minutes, remove from oven. Spoon half the ketchup glaze over meatloaves (save\r\nthe rest for serving); return to oven until carrots are browned and tender, meatloaves are cooked through, and glaze is tacky, 4-5 minutes more.\r\n\r\n5. Meanwhile, melt 2 TBSP butter (4 TBSP for 4 servings) in pot used for potatoes over medium heat. Add remaining garlic and cook\r\nuntil fragrant, 30 seconds. Add potatoes and 1/4 tsp wasabi. Mash, adding splashes of reserved potato cooking liquid as necessary until smooth. Season with salt and pepper. (If you like things spicy, stir in more wasabi!)\r\n\r\n6. Divide meatloaves, mashed potatoes, and roasted carrots between plates. Sprinkle with scallion greens and serve with remaining ketchup glaze on the side for dipping.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/o2wb6p1581005243.jpg",
      "tags": null,
      "youtube": "",
      "source": "",
      "ingredients": [
        {
          "ingredient": "Potatoes",
          "measure": "5"
        },
        {
          "ingredient": "Carrots",
          "measure": "12 ounces"
        },
        {
          "ingredient": "Scallions",
          "measure": "1"
        },
        {
          "ingredient": "Garlic",
          "measure": "2 cloves"
        },
        {
          "ingredient": "Bread",
          "measure": "1 Slice"
        },
        {
          "ingredient": "Garlic Powder",
          "measure": "1"
        },
        {
          "ingredient": "Soy Sauce",
          "measure": "2"
        },
        {
          "ingredient": "Ground Beef",
          "measure": "1"
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Sugar",
          "measure": "2 tsp"
        },
        {
          "ingredient": "Butter",
          "measure": "2 tbsp"
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "52811",
      "meal": "Ribollita",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "Italian",
      "instructions": "Put 2 tablespoons of the oil in a large pot over medium heat. When it’s hot, add onion, carrot, celery and garlic; sprinkle with salt and pepper and cook, stirring occasionally, until vegetables are soft, 5 to 10 minutes.\r\nHeat the oven to 500 degrees. Drain the beans; if they’re canned, rinse them as well. Add them to the pot along with tomatoes and their juices and stock, rosemary and thyme. Bring to a boil, then reduce heat so the soup bubbles steadily; cover and cook, stirring once or twice to break up the tomatoes, until the flavors meld, 15 to 20 minutes.\r\nFish out and discard rosemary and thyme stems, if you like, and stir in kale. Taste and adjust seasoning. Lay bread slices on top of the stew so they cover the top and overlap as little as possible. Scatter red onion slices over the top, drizzle with the remaining 3 tablespoons oil and sprinkle with Parmesan.\r\nPut the pot in the oven and bake until the bread, onions and cheese are browned and crisp, 10 to 15 minutes. (If your pot fits under the broiler, you can also brown the top there.) Divide the soup and bread among 4 bowls and serve.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/xrrwpx1487347049.jpg",
      "tags": "Vegetarian",
      "youtube": "https://www.youtube.com/watch?v=BiQUYTBb6eQ",
      "source": "https://cooking.nytimes.com/recipes/1016052-ribollita",
      "ingredients": [
        {
          "ingredient": "Olive Oil",
          "measure": "5 tablespoons"
        },
        {
          "ingredient": "Onion",
          "measure": "1 chopped"
        },
        {
          "ingredient": "Carrots",
          "measure": "1 chopped"
        },
        {
          "ingredient": "Celery",
          "measure": "1 stalk chopped"
        },
        {
          "ingredient": "Garlic",
          "measure": "1 tablespoon minced"
        },
        {
          "ingredient": "Cannellini Beans",
          "measure": "2 cups"
        },
        {
          "ingredient": "Canned tomatoes",
          "measure": "1"
        },
        {
          "ingredient": "Water",
          "measure": "4 cups"
        },
        {
          "ingredient": "Rosemary",
          "measure": "1 fresh sprig"
        },
        {
          "ingredient": "Thyme",
          "measure": "1 fresh sprig"
        },
        {
          "ingredient": "Kale",
          "measure": "1 pound chopped"
        },
        {
          "ingredient": "Wholegrain Bread",
          "measure": "4 thick slices"
        },
        {
          "ingredient": "Red Onions",
          "measure": "1 thinly sliced"
        },
        {
          "ingredient": "Parmesan",
          "measure": "½ cup freshly grated"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "52928",
      "meal": "BeaverTails",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "Canadian",
      "instructions": "In the bowl of a stand mixer, add warm water, a big pinch of sugar and yeast. Allow to sit until frothy.\r\nInto the same bowl, add 1/2 cup sugar, warm milk, melted butter, eggs and salt, and whisk until combined.\r\nPlace a dough hook on the mixer, add the flour with the machine on, until a smooth but slightly sticky dough forms.\r\nPlace dough in a bowl, cover with plastic wrap, and allow to proof for 1 1/2 hours.\r\nCut dough into 12 pieces, and roll out into long oval-like shapes about 1/4 inch thick that resemble a beaver’s tail.\r\nIn a large, deep pot, heat oil to 350 degrees. Gently place beavertail dough into hot oil and cook for 30 to 45 seconds on each side until golden brown.\r\nDrain on paper towels, and garnish as desired. Toss in cinnamon sugar, in white sugar with a squeeze of lemon, or with a generous slathering of Nutella and a handful of toasted almonds. Enjoy!",
      "mealThumb": "https://www.themealdb.com/images/media/meals/ryppsv1511815505.jpg",
      "tags": "Treat,Pudding,Speciality",
      "youtube": "https://www.youtube.com/watch?v=2G07UOqU2e8",
      "source": "https://www.tastemade.com/videos/beavertails",
      "ingredients": [
        {
          "ingredient": "Water",
          "measure": "1/2 cup "
        },
        {
          "ingredient": "Yeast",
          "measure": "2 parts "
        },
        {
          "ingredient": "Sugar",
          "measure": "1/2 cup "
        },
        {
          "ingredient": "Milk",
          "measure": "1/2 cup "
        },
        {
          "ingredient": "Butter",
          "measure": "6 tblsp"
        },
        {
          "ingredient": "Eggs",
          "measure": "2"
        },
        {
          "ingredient": "Salt",
          "measure": "1 ½ tsp"
        },
        {
          "ingredient": "Flour",
          "measure": "2-1/2 cups"
        },
        {
          "ingredient": "Oil",
          "measure": "for frying"
        },
        {
          "ingredient": "Lemon",
          "measure": "garnish"
        },
        {
          "ingredient": "Sugar",
          "measure": "garnish"
        },
        {
          "ingredient": "Cinnamon",
          "measure": "garnish"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "53009",
      "meal": "Lamb and Lemon Souvlaki",
      "drinkAlternate": null,
      "category": "Lamb",
      "area": "Greek",
      "instructions": "Pound the garlic with sea salt in a pestle and mortar (or use a small food processor), until the garlic forms a paste. Whisk together the oil, lemon juice, zest, dill and garlic. Mix in the lamb and combine well. Cover and marinate for at least 2 hrs or overnight in the fridge. If you’re going to use bamboo skewers, soak them in cold water.\r\n\r\nIf you’ve prepared the lamb the previous day, take it out of the fridge 30 mins before cooking. Thread the meat onto the soaked or metal skewers. Heat the grill to high or have a hot griddle pan or barbecue ready. Cook the skewers for 2-3 mins on each side, basting with the remaining marinade. Heat the pitta or flatbreads briefly, then stuff with the souvlaki. Add Greek salad (see 'Goes well with', right) and Tzatziki (below), if you like.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/rjhf741585564676.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=krR4rhjR75Y",
      "source": "https://www.bbcgoodfood.com/recipes/lamb-lemon-dill-souvlaki",
      "ingredients": [
        {
          "ingredient": "Garlic",
          "measure": "2 cloves"
        },
        {
          "ingredient": "Sea Salt",
          "measure": "2 tsp"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "4 tbs"
        },
        {
          "ingredient": "Lemon",
          "measure": "Zest and juice of 1"
        },
        {
          "ingredient": "Dill",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Lamb Leg",
          "measure": "750g"
        },
        {
          "ingredient": "Pita Bread",
          "measure": "To serve"
        }
      ],
      "categoryId": "4"
    },
    {
      "id": "52988",
      "meal": "Classic Christmas pudding",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "British",
      "instructions": "Get everything for the pudding prepared. Chop the almonds coarsely. Peel, core and chop the cooking apples. Sharpen your knife and chop the candied peel. (You can chop the almonds and apples in a food processor, but the peel must be done by hand.) Grate three quarters of the nutmeg (sounds a lot but it's correct).\r\n\r\nMix the almonds, apples, candied peel, nutmeg, raisins, flour, breadcrumbs, light muscovado sugar, eggs and 2 tbsp brandy or cognac in a large bowl.\u2028\r\n\r\nHolding the butter in its wrapper, grate a quarter of it into the bowl, then stir everything together. Repeat until all the butter is grated, then stir for 3-4 mins – the mixture is ready when it subsides slightly after each stir. Ask the family to stir too, and get everyone to make a wish.\u2028\r\n\r\nGenerously butter two 1.2 litre bowls and put a circle of baking parchment in the bottom of each. Pack in the pudding mixture. Cover with a double layer of baking parchment, pleating it to allow for expansion, then tie with string (keep the paper in place with a rubber band while tying). Trim off any excess paper.\u2028\r\n\r\nNow stand each bowl on a large sheet of foil and bring the edges up over the top, then put another sheet of foil over the top and bring it down underneath to make a double package (this makes the puddings watertight). Tie with more string, and make a handle for easy lifting in and out of the pan. Watch our video to see how to tie up a pudding correctly.\r\n\r\nBoil or oven steam the puddings for 8 hrs, topping up with water as necessary. Remove from the pans and leave to cool overnight. When cold, discard the messy wrappings and re-wrap in new baking parchment, foil and string. Store in a cool, dry place until Christmas.\u2028\r\n\r\nTo make the brandy butter, cream the butter with the orange zest and icing sugar. Gradually beat in the brandy or cognac and chopped stem ginger. Put in a small bowl, fork the top attractively and put in the fridge to set. The butter will keep for a week in the fridge, or it can be frozen for up to six weeks.\u2028\r\n\r\nOn Christmas Day, boil or oven steam for 1 hr. Unwrap and turn out. To flame, warm 3-4 tbsp brandy in a small pan, pour it over the pudding and set light to it.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/1d85821576790598.jpg",
      "tags": "Christmas",
      "youtube": "https://www.youtube.com/watch?v=Pb_lJxL1vtk",
      "source": "https://www.bbcgoodfood.com/recipes/classic-christmas-pudding",
      "ingredients": [
        {
          "ingredient": "Almonds",
          "measure": "50g"
        },
        {
          "ingredient": "Bramley Apples",
          "measure": "2 large"
        },
        {
          "ingredient": "Candied Peel",
          "measure": "200g"
        },
        {
          "ingredient": "Nutmeg",
          "measure": "1 whole"
        },
        {
          "ingredient": "Raisins",
          "measure": "1kg"
        },
        {
          "ingredient": "Plain Flour",
          "measure": "140g"
        },
        {
          "ingredient": "Breadcrumbs",
          "measure": "100g "
        },
        {
          "ingredient": "Muscovado Sugar",
          "measure": "100g "
        },
        {
          "ingredient": "Eggs",
          "measure": "3 Large"
        },
        {
          "ingredient": "Brandy",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Butter",
          "measure": "250g"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52908",
      "meal": "Ratatouille",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "French",
      "instructions": "Cut the aubergines in half lengthways. Place them on the board, cut side down, slice in half lengthways again and then across into 1.5cm chunks. Cut off the courgettes ends, then across into 1.5cm slices. Peel the peppers from stalk to bottom. Hold upright, cut around the stalk, then cut into 3 pieces. Cut away any membrane, then chop into bite-size chunks.\r\nScore a small cross on the base of each tomato, then put them into a heatproof bowl. Pour boiling water over the tomatoes, leave for 20 secs, then remove. Pour the water away, replace the tomatoes and cover with cold water. Leave to cool, then peel the skin away. Quarter the tomatoes, scrape away the seeds with a spoon, then roughly chop the flesh.\r\nSet a sauté pan over medium heat and when hot, pour in 2 tbsp olive oil. Brown the aubergines for 5 mins on each side until the pieces are soft. Set them aside and fry the courgettes in another tbsp oil for 5 mins, until golden on both sides. Repeat with the peppers. Don’t overcook the vegetables at this stage, as they have some more cooking left in the next step.\r\nTear up the basil leaves and set aside. Cook the onion in the pan for 5 mins. Add the garlic and fry for a further min. Stir in the vinegar and sugar, then tip in the tomatoes and half the basil. Return the vegetables to the pan with some salt and pepper and cook for 5 mins. Serve with basil.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wrpwuu1511786491.jpg",
      "tags": "Vegetables,SideDish",
      "youtube": "https://www.youtube.com/watch?v=BFdQUgAFtGU",
      "source": "https://www.bbcgoodfood.com/recipes/2903/ratatouille",
      "ingredients": [
        {
          "ingredient": "Aubergine",
          "measure": "2 large"
        },
        {
          "ingredient": "Courgettes",
          "measure": "4"
        },
        {
          "ingredient": "Yellow Pepper",
          "measure": "2"
        },
        {
          "ingredient": "Tomato",
          "measure": "4 large"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "5 tbs"
        },
        {
          "ingredient": "Basil",
          "measure": "Bunch"
        },
        {
          "ingredient": "Onion",
          "measure": "1 medium"
        },
        {
          "ingredient": "Garlic Clove",
          "measure": "3 finely chopped"
        },
        {
          "ingredient": "Red Wine Vinegar",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Sugar",
          "measure": "1 tsp "
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "53038",
      "meal": "Mustard champ",
      "drinkAlternate": null,
      "category": "Side",
      "area": "Irish",
      "instructions": "STEP 1\r\nBoil the potatoes for 15 mins or until tender. Drain, then mash.\r\n\r\nSTEP 2\r\nHeat the milk and half the butter in the corner of the pan, then beat into the mash, along with the wholegrain mustard.\r\n\r\nSTEP 3\r\nGently fry the spring onions in the remaining butter for 2 mins until just soft but still a perky green. Fold into the mash and serve. Great with gammon or to top a fish pie.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/o7p9581608589317.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=_iKllHSC978",
      "source": "https://www.bbcgoodfood.com/recipes/mustard-champ",
      "ingredients": [
        {
          "ingredient": "Potatoes",
          "measure": "1kg"
        },
        {
          "ingredient": "Milk",
          "measure": "200ml"
        },
        {
          "ingredient": "Butter",
          "measure": "50g"
        },
        {
          "ingredient": "Mustard",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Spring Onions",
          "measure": "Bunch"
        },
        {
          "ingredient": "Spring Onions",
          "measure": "Bunch"
        }
      ],
      "categoryId": "9"
    },
    {
      "id": "52851",
      "meal": "Nutty Chicken Curry",
      "drinkAlternate": null,
      "category": "Chicken",
      "area": "Indian",
      "instructions": "Finely slice a quarter of the chilli, then put the rest in a food processor with the ginger, garlic, coriander stalks and one-third of the leaves. Whizz to a rough paste with a splash of water if needed.\r\nHeat the oil in a frying pan, then quickly brown the chicken chunks for 1 min. Stir in the paste for another min, then add the peanut butter, stock and yogurt. When the sauce is gently bubbling, cook for 10 mins until the chicken is just cooked through and sauce thickened. Stir in most of the remaining coriander, then scatter the rest on top with the chilli, if using. Eat with rice or mashed sweet potato.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/yxsurp1511304301.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=nSQNfZxOdeU",
      "source": "https://www.bbcgoodfood.com/recipes/11753/nutty-chicken-curry",
      "ingredients": [
        {
          "ingredient": "Red Chilli",
          "measure": "1 large"
        },
        {
          "ingredient": "Ginger",
          "measure": "0.5"
        },
        {
          "ingredient": "Garlic",
          "measure": "1 large"
        },
        {
          "ingredient": "Coriander",
          "measure": "Bunch"
        },
        {
          "ingredient": "Sunflower Oil",
          "measure": "1 tbsp"
        },
        {
          "ingredient": "Chicken Breasts",
          "measure": "4"
        },
        {
          "ingredient": "Peanut Butter",
          "measure": "5 tblsp "
        },
        {
          "ingredient": "Chicken Stock",
          "measure": "150ml"
        },
        {
          "ingredient": "Greek Yogurt",
          "measure": "200g"
        }
      ],
      "categoryId": "2"
    },
    {
      "id": "53072",
      "meal": "Crispy Eggplant",
      "drinkAlternate": null,
      "category": "Vegetarian",
      "area": "Filipino",
      "instructions": "Slice eggplant into 1 cm (0.4-inch) slices. Place them in a bowl and sprinkle them with salt. allow them to sit for 30 minutes to render some of their liquid and bitterness.\r\n2. After 30 minutes wash eggplant slices from salt and pat dry with a kitchen towel.\r\n3. In a large bowl/plate place breadcrumbs and sesame seeds. In another bowl beat 2 eggs with pinch salt and pepper.\r\n4. Heal oil in a large skillet over high heat.\r\n5. Dip eggplant slices in egg, then in crumbs, and place in hot oil. Fry 2 to 3 minutes on each side, or until golden brown. Drain on a paper towel. \r\n",
      "mealThumb": "https://www.themealdb.com/images/media/meals/c7lzrl1683208757.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=4mINk5d2hto",
      "source": "https://yummyfood.ph/recipe/crispiest-fried-eggplant/",
      "ingredients": [
        {
          "ingredient": "Egg Plants",
          "measure": "1 large"
        },
        {
          "ingredient": "Breadcrumbs",
          "measure": "1 cup "
        },
        {
          "ingredient": "Sesame Seed",
          "measure": "50g"
        },
        {
          "ingredient": "Eggs",
          "measure": "2"
        },
        {
          "ingredient": "Salt",
          "measure": "To taste"
        },
        {
          "ingredient": "Pepper",
          "measure": "To taste"
        },
        {
          "ingredient": "Vegetable Oil",
          "measure": "For frying"
        }
      ],
      "categoryId": "12"
    },
    {
      "id": "52954",
      "meal": "Hot and Sour Soup",
      "drinkAlternate": null,
      "category": "Pork",
      "area": "Chinese",
      "instructions": "STEP 1 - MAKING THE SOUP\r\nIn a wok add chicken broth and wait for it to boil.\r\nNext add salt, sugar, sesame seed oil, white pepper, hot pepper sauce, vinegar and soy sauce and stir for few seconds.\r\nAdd Tofu, mushrooms, black wood ear mushrooms to the wok.\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness.\r\nNext add 1 egg slightly beaten with a knife or fork and add it to the soup and stir for 8 seconds\r\nServe the soup in a bowl and add the bbq pork and sliced green onions on top.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/1529445893.jpg",
      "tags": "Soup",
      "youtube": "https://www.youtube.com/watch?v=KgV9Zq3aSTo",
      "source": "https://sueandgambo.com/pages/chinese-hot-and-sour-soup",
      "ingredients": [
        {
          "ingredient": "Mushrooms",
          "measure": "1/3 cup"
        },
        {
          "ingredient": "Wood Ear Mushrooms",
          "measure": "1/3 cup"
        },
        {
          "ingredient": "Tofu",
          "measure": "2/3 Cup"
        },
        {
          "ingredient": "Pork",
          "measure": "1/2 cup "
        },
        {
          "ingredient": "Chicken Stock",
          "measure": "2-1/2 cups"
        },
        {
          "ingredient": "Salt",
          "measure": "1/2 tsp"
        },
        {
          "ingredient": "Sugar",
          "measure": "1/4 tsp"
        },
        {
          "ingredient": "Sesame Seed Oil",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Pepper",
          "measure": "1/4 tsp"
        },
        {
          "ingredient": "Hotsauce",
          "measure": "1/2 tsp"
        },
        {
          "ingredient": "Vinegar",
          "measure": "1-½ cups"
        },
        {
          "ingredient": "Soy Sauce",
          "measure": "1 tsp "
        },
        {
          "ingredient": "Cornstarch",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Water",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Spring Onions",
          "measure": "1/4 cup"
        }
      ],
      "categoryId": "7"
    },
    {
      "id": "52768",
      "meal": "Apple Frangipan Tart",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "British",
      "instructions": "Preheat the oven to 200C/180C Fan/Gas 6.\r\nPut the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling.\r\nCream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.\r\nPeel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.\r\nBake for 20-25 minutes until golden-brown and set.\r\nRemove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.\r\nTransfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wxywrq1468235067.jpg",
      "tags": "Tart,Baking,Fruity",
      "youtube": "https://www.youtube.com/watch?v=rp8Slv4INLk",
      "source": null,
      "ingredients": [
        {
          "ingredient": "digestive biscuits",
          "measure": "175g/6oz"
        },
        {
          "ingredient": "butter",
          "measure": "75g/3oz"
        },
        {
          "ingredient": "Bramley apples",
          "measure": "200g/7oz"
        },
        {
          "ingredient": "Salted Butter",
          "measure": "75g/3oz"
        },
        {
          "ingredient": "caster sugar",
          "measure": "75g/3oz"
        },
        {
          "ingredient": "free-range eggs, beaten",
          "measure": "2"
        },
        {
          "ingredient": "ground almonds",
          "measure": "75g/3oz"
        },
        {
          "ingredient": "almond extract",
          "measure": "1 tsp"
        },
        {
          "ingredient": "flaked almonds",
          "measure": "50g/1¾oz"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "53033",
      "meal": "Japanese gohan rice",
      "drinkAlternate": null,
      "category": "Side",
      "area": "Japanese",
      "instructions": "STEP 1\r\nRinsing and soaking your rice is key to achieving the perfect texture. Measure the rice into a bowl, cover with cold water, then use your fingers to massage the grains of rice – the water will become cloudy. Drain and rinse again with fresh water. Repeat five more times until the water stays clear.\r\n\r\nSTEP 2\r\nTip the rinsed rice into a saucepan with 400ml water, or 200ml dashi and 200ml water, bring to the boil, then turn down the heat to a low simmer, cover with a tight-fitting lid with a steam hole and cook for 15 mins. Remove from the heat and leave to sit for another 15 mins, then stir through the mirin. Remove the lid and give it a good stir. Serve with any or all of the optional toppings.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/kw92t41604181871.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=rZO86_-MIp0",
      "source": "https://www.bbcgoodfood.com/recipes/japanese-rice-gohan",
      "ingredients": [
        {
          "ingredient": "Sushi Rice",
          "measure": "300g"
        },
        {
          "ingredient": "Mirin",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Pickle Juice",
          "measure": "Garnish"
        },
        {
          "ingredient": "Spring Onions",
          "measure": "Garnish"
        }
      ],
      "categoryId": "9"
    },
    {
      "id": "53068",
      "meal": "Beef Mechado",
      "drinkAlternate": null,
      "category": "Beef",
      "area": "Filipino",
      "instructions": "0.\tMake the beef tenderloin marinade by combining soy sauce, vinegar, ginger, garlic, sesame oil, olive oil, sugar, salt, and ground black pepper in a large bowl. Mix well.\r\n1.\tAdd the cubed beef tenderloin to the bowl with the beef tenderloin marinade. Gently toss to coat the beef. Let it stay for 1 hour.\r\n2.\tUsing a metal or bamboo skewer, assemble the beef kebob by skewering the vegetables and marinated beef tenderloin.\r\n3.\tHeat-up the grill and start grilling the beef kebobs for 3 minutes per side. This will give you a medium beef that is juicy and tender on the inside. Add more time if you want your beef well done, but it will be less tender.\r\n4.\tTransfer to a serving plate. Serve with Saffron rice.\r\n5.\tShare and enjoy!\r\n",
      "mealThumb": "https://www.themealdb.com/images/media/meals/cgl60b1683206581.jpg",
      "tags": "Stew,Warming",
      "youtube": "https://www.youtube.com/watch?v=jxW3Lj8VjyE",
      "source": "https://panlasangpinoy.com/filipino-pinoy-food-tomato-sauce-beef-mechado-recipe/",
      "ingredients": [
        {
          "ingredient": "Garlic",
          "measure": "3 cloves"
        },
        {
          "ingredient": "Onion",
          "measure": "1 sliced"
        },
        {
          "ingredient": "Beef",
          "measure": "2 Lbs"
        },
        {
          "ingredient": "Tomato Puree",
          "measure": "8 ounces"
        },
        {
          "ingredient": "Water",
          "measure": "1 cup "
        },
        {
          "ingredient": "Olive Oil",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Lemon",
          "measure": "1 Slice"
        },
        {
          "ingredient": "Potatoes",
          "measure": "1 large"
        },
        {
          "ingredient": "Soy Sauce",
          "measure": "1/4 cup"
        },
        {
          "ingredient": "Black Pepper",
          "measure": "1/2 tsp"
        },
        {
          "ingredient": "Bay Leaves",
          "measure": "2"
        },
        {
          "ingredient": "Salt",
          "measure": "To taste"
        }
      ],
      "categoryId": "1"
    },
    {
      "id": "52894",
      "meal": "Battenberg Cake",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "British",
      "instructions": "Heat oven to 180C/160C fan/gas 4 and line the base and sides of a 20cm square tin with baking parchment (the easiest way is to cross 2 x 20cm-long strips over the base). To make the almond sponge, put the butter, sugar, flour, ground almonds, baking powder, eggs, vanilla and almond extract in a large bowl. Beat with an electric whisk until the mix comes together smoothly. Scrape into the tin, spreading to the corners, and bake for 25-30 mins – when you poke in a skewer, it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling while you make the second sponge.\r\nFor the pink sponge, line the tin as above. Mix all the ingredients together as above, but don’t add the almond extract. Fold in some pink food colouring. Then scrape it all into the tin and bake as before. Cool.\r\nTo assemble, heat the jam in a small pan until runny, then sieve. Barely trim two opposite edges from the almond sponge, then well trim a third edge. Roughly measure the height of the sponge, then cutting from the well-trimmed edge, use a ruler to help you cut 4 slices each the same width as the sponge height. Discard or nibble leftover sponge. Repeat with pink cake.\r\nTake 2 x almond slices and 2 x pink slices and trim so they are all the same length. Roll out one marzipan block on a surface lightly dusted with icing sugar to just over 20cm wide, then keep rolling lengthways until the marzipan is roughly 0.5cm thick. Brush with apricot jam, then lay a pink and an almond slice side by side at one end of the marzipan, brushing jam in between to stick sponges, and leaving 4cm clear marzipan at the end. Brush more jam on top of the sponges, then sandwich remaining 2 slices on top, alternating colours to give a checkerboard effect. Trim the marzipan to the length of the cakes.\r\nCarefully lift up the marzipan and smooth over the cake with your hands, but leave a small marzipan fold along the bottom edge before you stick it to the first side. Trim opposite side to match size of fold, then crimp edges using fingers and thumb (or, more simply, press with prongs of fork). If you like, mark the 10 slices using the prongs of a fork.\r\nAssemble second Battenberg and keep in an airtight box or well wrapped in cling film for up to 3 days. Can be frozen for up to a month.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/ywwrsp1511720277.jpg",
      "tags": "Cake,Sweet",
      "youtube": "https://www.youtube.com/watch?v=aB41Q7kDZQ0",
      "source": "https://www.bbcgoodfood.com/recipes/1120657/battenberg-cake",
      "ingredients": [
        {
          "ingredient": "Butter",
          "measure": "175g"
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "175g"
        },
        {
          "ingredient": "Self-raising Flour",
          "measure": "140g"
        },
        {
          "ingredient": "Almonds",
          "measure": "50g"
        },
        {
          "ingredient": "Baking Powder",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Eggs",
          "measure": "3 Medium"
        },
        {
          "ingredient": "Vanilla Extract",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Almond Extract",
          "measure": "¼ teaspoon"
        },
        {
          "ingredient": "Butter",
          "measure": "175g"
        },
        {
          "ingredient": "Caster Sugar",
          "measure": "175g"
        },
        {
          "ingredient": "Self-raising Flour",
          "measure": "140g"
        },
        {
          "ingredient": "Almonds",
          "measure": "50g"
        },
        {
          "ingredient": "Baking Powder",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Eggs",
          "measure": "3 Medium"
        },
        {
          "ingredient": "Vanilla Extract",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Almond Extract",
          "measure": "¼ teaspoon"
        },
        {
          "ingredient": "Pink Food Colouring",
          "measure": "½ tsp"
        },
        {
          "ingredient": "Apricot",
          "measure": "200g"
        },
        {
          "ingredient": "Marzipan",
          "measure": "1kg"
        },
        {
          "ingredient": "Icing Sugar",
          "measure": "Dusting"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "53048",
      "meal": "Mee goreng mamak",
      "drinkAlternate": null,
      "category": "Seafood",
      "area": "Malaysian",
      "instructions": "Heat oil in a pan at medium heat. Then, add peanuts, dried chilies, dried shrimps and dhal. Fry the aromatics until fragrant. Remove from pan and leave aside.\r\n\r\nBlend fried ingredients with tamarind paste and water until fine. Then, sauté the blended ingredients in oil heated over low heat. Continue cooking until the oil separates from the paste and turns a darker shade.\r\n\r\nSkin and cut potatoes into small chunks and boil them in a pot of water until knife-tender. Once ready, remove them from the pot and leave aside. Discard water.\r\n\r\nSlice onion and fried tofu, mince garlic, cut some cabbage and Chinese flowering cabbage (choi sam). Prepare prawn fritters and cut them. Boil noodles to soften them if bought dried. Also mix black soy sauce with water.\r\n\r\nTo fry one portion of mee goreng mamak, heat oil and add 1/4 of the following ingredients in this order: garlic, onion, paste. Sauté until fragrant. Optionally, add prawns.\r\n\r\nAdd in 1/4 amount of tofu, boiled potatoes, cabbage, Chinese flowering cabbage and prawn fritters. Sauté for another 30 seconds.\r\n\r\nAdd noodles to the wok. Add 3 tablespoons of dark soy sauce mixture. Mix evenly for the next 1 minute. Then, move the noodles to the side of the wok. Stir in an egg. Garnish with a slice of lime and slices of green chilies. To cook another plate of noodles, repeat from step 5 onwards.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/xquakq1619787532.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=pOJEmDBgtSk",
      "source": "https://www.nyonyacooking.com/recipes/mee-goreng-mamak~BkTLRjTuX",
      "ingredients": [
        {
          "ingredient": "Peanuts",
          "measure": "50g"
        },
        {
          "ingredient": "Chilli",
          "measure": "15g"
        },
        {
          "ingredient": "Prawns",
          "measure": "10g"
        },
        {
          "ingredient": "Oil",
          "measure": "5 tbs"
        },
        {
          "ingredient": "Water",
          "measure": "750 ml "
        },
        {
          "ingredient": "Tamarind Paste",
          "measure": "1/2 tbs"
        },
        {
          "ingredient": "Potatoes",
          "measure": "250g"
        },
        {
          "ingredient": "Red Onions",
          "measure": "2"
        },
        {
          "ingredient": "Garlic Clove",
          "measure": "4"
        },
        {
          "ingredient": "Cabbage",
          "measure": "30g"
        },
        {
          "ingredient": "Chinese Broccoli",
          "measure": "30g"
        },
        {
          "ingredient": "Tofu",
          "measure": "1"
        },
        {
          "ingredient": "Soy Sauce",
          "measure": "1 tbs"
        },
        {
          "ingredient": "Noodles",
          "measure": "4"
        },
        {
          "ingredient": "Egg",
          "measure": "1"
        }
      ],
      "categoryId": "8"
    },
    {
      "id": "52890",
      "meal": "Jam Roly-Poly",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "British",
      "instructions": "Put a deep roasting tin onto the bottom shelf of the oven, and make sure that there’s another shelf directly above it. Pull the roasting tin out on its shelf, fill two-thirds with boiling water from the kettle, then carefully slide it back in. Heat oven to 180C/160C fan/gas 4. Tear off a large sheet of foil and greaseproof paper (about 30 x 40cm). Sit the greaseproof on top of the foil and butter it.\r\nTip butter, flour and vanilla seeds into a food processor; pulse until the butter has disappeared. Tip into a mixing bowl. Stir through the suet, pour in the milk and work together with a cutlery knife until you get a sticky dough. You may need a drop more milk, depending on your flour.\r\nTip the dough out onto a floured surface, quickly pat together to smooth, then roll out to a square roughly 25 x 25cm. Spread the jam all over, leaving a gap along one edge, then roll up from the opposite edge. Pinch the jam-free edge into the dough where it meets, and pinch the ends roughly, too. Carefully lift onto the greased paper, join-side down (you might find a flat baking sheet helpful for this), loosely bring up the paper and foil around it, then scrunch together along the edges and ends to seal. The roly-poly will puff quite a bit during cooking so don’t wrap it tightly. Lift the parcel directly onto the rack above the tin and cook for 1 hr.\r\nLet the pudding sit for 5 mins before unwrapping, then carefully open the foil and paper, and thickly slice to serve.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/ysqupp1511640538.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=5ZYWVQ8imVA",
      "source": "https://www.bbcgoodfood.com/recipes/13354/jam-rolypoly",
      "ingredients": [
        {
          "ingredient": "Butter",
          "measure": "50g"
        },
        {
          "ingredient": "Self-raising Flour",
          "measure": "250g"
        },
        {
          "ingredient": "Vanilla",
          "measure": "1 small"
        },
        {
          "ingredient": "Suet",
          "measure": "50g"
        },
        {
          "ingredient": "Milk",
          "measure": "150ml"
        },
        {
          "ingredient": "Raspberry Jam",
          "measure": "100g "
        },
        {
          "ingredient": "Custard",
          "measure": "to serve"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52836",
      "meal": "Seafood fideuà",
      "drinkAlternate": null,
      "category": "Seafood",
      "area": "Spanish",
      "instructions": "Boil the kettle. Empty the mussels into a colander and run under cold water. Throw away any with broken shells. Pick through the shells, tapping each one on the side of the sink – they should be closed or should slowly close when tapped – if they stay open, throw them away. If any of the shells still have barnacles or stringy beards attached, pull them off with a cutlery knife and rinse the shells well. Keep in the colander, covered with a cold, damp cloth, until you’re ready to cook. Peel the prawn shells on the body section only – leave the heads and tails intact. Score down the backs and pull out any gritty entrails. Chill until you’re ready to cook.\r\nPut the saffron in a small cup, cover with 50ml kettle-hot water and set aside for 10 mins. If using vermicelli, put in a bowl and crush to little pieces (about 1cm long) with your hands.\r\nHeat the oil in a large frying pan with at least a 3cm lip, or a 40cm paella pan. Add the onion and stir around the pan for 5 mins until soft. Add the garlic and cook for 1 min more, then tip in the vermicelli and cook for 5 mins, stirring from time to time, until the vermicelli is toasted brown. Stir in the paprika.\r\nKeeping the heat moderate, stir through the monkfish, squid and saffron with its water, seasoning well. Spread the ingredients out in an even layer, then pour over the hot stock and scatter the tomatoes on top. Bring to a simmer, then cover the whole dish with a tight-fitting lid (or foil). Turn the heat to medium and cook for 6 mins.\r\nUncover and stir to incorporate the dry top layer of pasta. Push the mussels into the pasta so the hinges are buried in the bottom of the dish, and they stand straight up. Arrange the prawns on top, cover tightly and cook for another 6 mins or until the mussels are open, the prawns are pink and the pasta is cooked through. Leave to simmer for another 2-3 mins to cook off most of the remaining liquid (leave a little in the pan to prevent the pasta from sticking together). Allow to sit for 2-3 mins, then squeeze over the lemon juice and arrange the wedges on top. Scatter with parsley before serving.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/wqqvyq1511179730.jpg",
      "tags": null,
      "youtube": "https://www.youtube.com/watch?v=itsFEc8W468",
      "source": "https://www.bbcgoodfood.com/recipes/seafood-fideua-paella",
      "ingredients": [
        {
          "ingredient": "Mussels",
          "measure": "400g"
        },
        {
          "ingredient": "Prawns",
          "measure": "8"
        },
        {
          "ingredient": "Saffron",
          "measure": "2 pinches"
        },
        {
          "ingredient": "Vermicelli Pasta",
          "measure": "350g"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "5 tblsp "
        },
        {
          "ingredient": "Onions",
          "measure": "1 large"
        },
        {
          "ingredient": "Garlic",
          "measure": "3 cloves"
        },
        {
          "ingredient": "Paprika",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Monkfish",
          "measure": "1 tail"
        },
        {
          "ingredient": "Baby Squid",
          "measure": "4"
        },
        {
          "ingredient": "Fish Stock",
          "measure": "650ml"
        },
        {
          "ingredient": "Tomatoes",
          "measure": "2 large"
        },
        {
          "ingredient": "Lemon",
          "measure": "Juice of 1"
        },
        {
          "ingredient": "Parsley",
          "measure": "Topping"
        }
      ],
      "categoryId": "8"
    },
    {
      "id": "52786",
      "meal": "Rocky Road Fudge",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "American",
      "instructions": "Line an 8-inch-square baking pan with wax paper or foil, and coat with non-stick spray.\r\nPour ½ cup of the miniature marshmallows into the bottom of the lined baking dish.\r\nIn a microwave-safe bowl, combine the chocolate chips and peanut butter. Microwave the chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nAdd the vanilla extract and stir well, until smooth.\r\nReserve 2 tablespoons of the chopped almonds or peanuts, and set aside.\r\nFold 1 ½ cups of the miniature marshmallows and the remaining chopped nuts into the chocolate mixture.\r\nTransfer the chocolate mixture into the prepared pan and spread into an even layer. Immediately top with the reserved chopped nuts and the mallow bits or additional miniature marshmallows, if using.\r\nRefrigerate for 4 hours, or until set.\r\nRemove the fudge and wax paper from the pan. Carefully peel all of wax paper from the fudge.\r\nCut the fudge into bite-sized pieces and serve.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/vtxyxv1483567157.jpg",
      "tags": "Chocolate,Snack,Sweet,Baking",
      "youtube": "https://www.youtube.com/watch?v=N1aJ3nEYXyg",
      "source": "http://tiphero.com/rocky-road-fudge/",
      "ingredients": [
        {
          "ingredient": "Miniature Marshmallows",
          "measure": "2 cups"
        },
        {
          "ingredient": "Chocolate Chips",
          "measure": "3 cups"
        },
        {
          "ingredient": "Peanut Butter",
          "measure": "½ cup"
        },
        {
          "ingredient": "Vanilla Extract",
          "measure": "1 tsp"
        },
        {
          "ingredient": "Peanuts",
          "measure": "1 ¼ cups"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52966",
      "meal": "Chocolate Caramel Crispy",
      "drinkAlternate": null,
      "category": "Dessert",
      "area": "British",
      "instructions": "Grease and line a 20 x 20cm/8\" x 8\" baking tin with parchment paper.\r\nPut the mars bars and butter in a heat proof bowl and place over a pan of barely simmering water. Mixing with a whisk, melt until the mixture is smooth.\r\nPour over the rice krispies in a mixing bowl and mix until all the ingredients are evenly combined. Press evenly into the prepare baking tin and set aside.\r\nMelt the milk chocolate in the microwave or over a pan of barely simmering water.\r\nSpread the melted chocolate over the rice krispie mixture and leave to set in a cool place. Once set slice into squares and serve!",
      "mealThumb": "https://www.themealdb.com/images/media/meals/1550442508.jpg",
      "tags": "Sweet,Snack,Treat,Tart,Alcoholic,BBQ",
      "youtube": "https://www.youtube.com/watch?v=qsk_At_gjv0",
      "source": "http://www.donalskehan.com/recipes/chocolate-caramel-rice-crispy-treats/",
      "ingredients": [
        {
          "ingredient": "Mars Bar",
          "measure": "6 chopped"
        },
        {
          "ingredient": "Butter",
          "measure": "150g"
        },
        {
          "ingredient": "Rice Krispies",
          "measure": "120g"
        },
        {
          "ingredient": "Milk Chocolate",
          "measure": "150g"
        }
      ],
      "categoryId": "3"
    },
    {
      "id": "52987",
      "meal": "Lasagna Sandwiches",
      "drinkAlternate": null,
      "category": "Pasta",
      "area": "American",
      "instructions": "1. In a small bowl, combine the first four ingredients; spread on four slices of bread. Layer with bacon, tomato and cheese; top with remaining bread.\r\n\r\n2. In a large skillet or griddle, melt 2 tablespoons butter. Toast sandwiches until lightly browned on both sides and cheese is melted, adding butter if necessary.\r\n\r\nNutrition Facts\r\n1 sandwich: 445 calories, 24g fat (12g saturated fat), 66mg cholesterol, 1094mg sodium, 35g carbohydrate (3g sugars, 2g fiber), 21g protein.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/xr0n4r1576788363.jpg",
      "tags": "Sandwich",
      "youtube": "",
      "source": "",
      "ingredients": [
        {
          "ingredient": "Sour Cream",
          "measure": "1/4 cup"
        },
        {
          "ingredient": "Chopped Onion",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Dried Oregano",
          "measure": "1/2 tbs"
        },
        {
          "ingredient": "Salt",
          "measure": "1/4 tsp"
        },
        {
          "ingredient": "Bread",
          "measure": "8 slices"
        },
        {
          "ingredient": "Bacon",
          "measure": "8 slices"
        },
        {
          "ingredient": "Tomato",
          "measure": "8 slices"
        },
        {
          "ingredient": "Mozzarella",
          "measure": "4 slices"
        },
        {
          "ingredient": "Butter",
          "measure": "2 1/2 Tbs"
        }
      ],
      "categoryId": "6"
    },
    {
      "id": "52918",
      "meal": "Fish Stew with Rouille",
      "drinkAlternate": null,
      "category": "Seafood",
      "area": "French",
      "instructions": "Twist the heads from the prawns, then peel away the legs and shells, but leave the tails intact. Devein each prawn. Fry the shells in 1 tbsp oil for 5 mins, until dark pink and golden in patches. Add the wine, boil down by two thirds, then pour in the stock. Strain into a jug, discarding the shells.\r\nHeat the rest of the oil in a deep frying pan or casserole. Add the fennel, onion and garlic, season, then cover and gently cook for 10 mins until softened. Meanwhile, peel the potato and cut into 2cm-ish chunks. Put into a pan of cold water, bring to the boil and cook for 5 mins until almost tender. Drain in a colander.\r\nPeel a strip of zest from the orange. Put the zest, star anise, bay and ½ tsp harissa into the pan. Fry gently, uncovered, for 5-10 mins, until the vegetables are soft, sweet and golden.\r\nStir in the tomato purée, cook for 2 mins, then add the tomatoes and stock. Simmer for 10 mins until the sauce thickens slightly. Season to taste. The sauce can be made ahead, then reheated later in the day. Meantime, scrub the mussels or clams and pull away any stringy beards. Any that are open should be tapped sharply on the worktop – if they don’t close after a few seconds, discard them.\r\nReheat the sauce if necessary, then stir the potato, chunks of fish and prawns very gently into the stew. Bring back to the boil, then cover and gently simmer for 3 mins. Scatter the mussels or clams over the stew, then cover and cook for 2 mins more or until the shells have opened wide. Discard any that remain closed. The chunks of fish should flake easily and the prawns should be pink through. Scatter with the thyme leaves.\r\nTo make the quick rouille, stir the rest of the harissa through the mayonnaise. Serve the stew in bowls, topped with spoonfuls of rouille, which will melt into the sauce and enrich it. Have some good bread ready, as you’ll definitely want to mop up the juices.",
      "mealThumb": "https://www.themealdb.com/images/media/meals/vptqpw1511798500.jpg",
      "tags": "Fish,Seafood,Shellfish",
      "youtube": "https://www.youtube.com/watch?v=fp9Lqx2EUco",
      "source": "https://www.bbcgoodfood.com/recipes/532640/summer-fish-stew-with-rouille",
      "ingredients": [
        {
          "ingredient": "Prawns",
          "measure": "6 large"
        },
        {
          "ingredient": "Olive Oil",
          "measure": "3 tbs"
        },
        {
          "ingredient": "Dry White Wine",
          "measure": "150ml"
        },
        {
          "ingredient": "Fish Stock",
          "measure": "200ml"
        },
        {
          "ingredient": "Fennel",
          "measure": "1 small finely diced"
        },
        {
          "ingredient": "Onion",
          "measure": "1 small finely diced"
        },
        {
          "ingredient": "Garlic",
          "measure": "3 cloves Chopped"
        },
        {
          "ingredient": "Potatoes",
          "measure": "1 large"
        },
        {
          "ingredient": "Orange",
          "measure": "1"
        },
        {
          "ingredient": "Star Anise",
          "measure": "1"
        },
        {
          "ingredient": "Bay Leaf",
          "measure": "1"
        },
        {
          "ingredient": "Harissa Spice",
          "measure": "1 1/2 tsp "
        },
        {
          "ingredient": "Tomato Puree",
          "measure": "2 tbs"
        },
        {
          "ingredient": "Chopped Tomatoes",
          "measure": "400g"
        },
        {
          "ingredient": "Mussels",
          "measure": "Handful"
        },
        {
          "ingredient": "White Fish",
          "measure": "200g"
        },
        {
          "ingredient": "Thyme",
          "measure": "2"
        },
        {
          "ingredient": "Bread",
          "measure": "to serve"
        }
      ],
      "categoryId": "8"
    }
  ]
}